status = -1;
var itemList = Array(
//-------耳环-------
Array(1032035, 500, 1, 1), //枫叶耳环
Array(1032040, 500, 1, 1), //枫叶型耳环
Array(1032041, 500, 1, 1), //枫叶型耳环
Array(1032042, 500, 1, 1), //枫叶型耳环
Array(1032047, 500, 1, 1), //可乐耳环
Array(1032055, 500, 1, 1), //工作人员C的旧收信机
Array(1032056, 500, 1, 1), //工作人员C的旧收信机
Array(1032057, 500, 1, 1), //工作人员C的旧收信机
Array(1032058, 500, 1, 1), //工作人员C钛质收信机
Array(1012070, 200, 1, 1), //工作人员C钛质收信机
Array(1012071, 200, 1, 1), //工作人员C钛质收信机
Array(1012072, 200, 1, 1), //工作人员C钛质收信机
Array(1012073, 200, 1, 1), //工作人员C钛质收信机
//-------帽子-------
Array(1002677, 300, 1, 1), //玩具匠人帽
Array(1002699, 300, 1, 1), //南瓜帽子
Array(1002773, 300, 1, 1), //金龙头盔
Array(1002776, 300, 1, 1), //永恒冠军盔
Array(1002777, 300, 1, 1), //永恒玄妙帽
Array(1002778, 300, 1, 1), //永恒霓翎帽
Array(1002779, 300, 1, 1), //永恒迷踪帽
Array(1002780, 300, 1, 1), //永恒海王星
Array(1002790, 300, 1, 1), //重生冠军盔
Array(1002791, 300, 1, 1), //重生玄妙帽
Array(1002792, 300, 1, 1), //重生霓翎帽
Array(1002793, 300, 1, 1), //重生迷踪帽
Array(1002794, 300, 1, 1), //重生海王星
//------披风------
Array(1102035, 600, 1, 0), //黑龙纹披风
Array(1102040, 300, 1, 1), //浪人披风(黄)
Array(1102041, 300, 1, 1), //浪人披风(粉)
Array(1102042, 300, 1, 1), //浪人披风(紫)
Array(1102043, 300, 1, 1), //浪人披风(褐)
Array(1102140, 400, 1, 1), //卡帕莱特披风
Array(1102147, 420, 1, 1), //玩具匠人披风
Array(1102172, 400, 1, 1), //永恒不灭披风
Array(1102174, 400, 1, 1), //工作人员披风
Array(1102166, 400, 1, 1), //枫叶披风
Array(1102167, 400, 1, 1), //枫叶披风
Array(1102168, 400, 1, 1), //枫叶披风
//------手套------
Array(1082137, 600, 1, 0), //侠盗手套(红)
Array(1082138, 600, 1, 0), //侠盗手套(黑)
Array(1082139, 600, 1, 0), //混天手套(黄)
Array(1082140, 600, 1, 0), //混天手套(紫)
Array(1082141, 600, 1, 0), //混天手套(褐)
Array(1082142, 600, 1, 0), //幻光手套(蓝)
Array(1082143, 600, 1, 0), //幻光手套(紫)
Array(1082144, 600, 1, 0), //幻光手套(红)
Array(1082145, 300, 1, 1), //工地手套(黄)
Array(1082146, 300, 1, 1), //工地手套(红)
Array(1082147, 300, 1, 1), //工地手套(蓝)
Array(1082148, 300, 1, 1), //工地手套(紫)
Array(1082149, 300, 1, 1), //工地手套(褐)
Array(1082150, 300, 1, 1), //工地手套(灰)
Array(1082234, 300, 1, 1), //永恒定边手套
Array(1082235, 300, 1, 1), //永恒逍遥手套
Array(1082236, 300, 1, 1), //永恒白云手套
Array(1082237, 300, 1, 1), //永恒探云手套
Array(1082238, 300, 1, 1), //永恒抚浪手套
Array(1082239, 300, 1, 1), //重生定边手套
Array(1082240, 300, 1, 1), //重生逍遥手套
Array(1082241, 300, 1, 1), //重生白云手套
Array(1082242, 300, 1, 1), //重生探云手套
Array(1082243, 300, 1, 1), //重生抚浪手套
//-------武器------
Array(1302016, 100, 1, 0), //黄色雨伞
Array(1302017, 100, 1, 0), //蓝色雨伞
Array(1302018, 100, 1, 1), //汤勺
Array(1302019, 100, 1, 1), //无名剑
Array(1302049, 100, 1, 0), //光线鞭子
Array(1302050, 100, 1, 0), //战剑
Array(1302051, 100, 1, 0), //树灵之剑
Array(1302052, 100, 1, 0), //奇型刀
Array(1302053, 100, 1, 0), //奇型刀
Array(1302054, 100, 1, 0), //汤勺
Array(1302056, 100, 1, 0), //一刀两断
Array(1302058, 100, 1, 0), //冒险岛伞
Array(1302059, 100, 1, 0), //狂龙闪电剑
Array(1302060, 100, 1, 0), //战剑
Array(1302061, 100, 1, 1), //蔓藤鞭子
Array(1302063, 100, 1, 1), //燃烧的火焰刀
Array(1302064, 100, 1, 0), //枫叶突击剑
Array(1302066, 100, 1, 0), //枫叶3年旗
Array(1302067, 100, 1, 0), //枫叶庆典旗
Array(1302068, 100, 1, 0), //薄光刃
Array(1302071, 100, 1, 1), //粉色花边游泳圈
Array(1302077, 100, 1, 0), //新手战士之剑
Array(1302080, 100, 1, 1), //七彩霓虹灯泡
Array(1302081, 120, 1, 1), //永恒破甲剑
Array(1302084, 240, 1, 1), //火柴
Array(1322020, 600, 1, 0), //黄金暴风锤
Array(1322021, 600, 1, 0), //黑游泳圈
Array(1322022, 600, 1, 0), //红花纹游泳圈
Array(1322023, 600, 1, 0), //蓝花纹游泳圈
Array(1322024, 600, 1, 0), //紫游泳圈
Array(1322025, 600, 1, 0), //救命游泳圈
Array(1322026, 600, 1, 0), //彩虹游泳圈
Array(1322027, 100, 1, 0), //米伽勒的平底锅
Array(1322028, 600, 1, 0), //钉头锤
Array(1322051, 600, 1, 1), //七夕
Array(1322052, 600, 1, 0), //狂龙地锤
Array(1322054, 600, 1, 0), //枫叶地震锤
Array(1322055, 600, 1, 0), //枫叶3年旗
Array(1322056, 600, 1, 0), //粉色花边游泳圈
Array(1322060, 100, 1, 1), //永恒惊破天
Array(1322061, 100, 1, 1), //重生惊破天
Array(1322071, 600, 1, 0), //采矿铁锹
Array(1372034, 100, 1, 0), //枫叶仙姬杖
Array(1372035, 100, 1, 1), //火灵珠短杖
Array(1372036, 100, 1, 1), //毒灵珠短杖
Array(1372037, 100, 1, 1), //冰灵珠短杖
Array(1372038, 100, 1, 1), //雷灵珠短杖
Array(1372039, 100, 1, 1), //爆炎之杖
Array(1372040, 100, 1, 1), //剧毒之杖
Array(1372041, 100, 1, 1), //寒冰之杖
Array(1372042, 100, 1, 1), //狂雷之杖
Array(1372043, 100, 1, 0), //初级魔法师的杖
Array(1372044, 100, 1, 1), //永恒蝶翼杖
Array(1372045, 100, 1, 1), //重生蝶翼杖
Array(1382013, 600, 1, 0), //烈焰之杖
Array(1382014, 600, 1, 0), //孙家之杖
Array(1382015, 500, 1, 1), //毒蘑菇
Array(1382016, 500, 1, 1), //香菇
Array(1382039, 100, 1, 0), //枫叶丹心杖
Array(1382040, 100, 1, 0), //枫叶3年旗
Array(1382041, 100, 1, 0), //夜行權杖
Array(1382042, 100, 1, 0), //粉色花边游泳圈
Array(1382045, 100, 1, 1), //火灵珠长杖
Array(1382046, 100, 1, 1), //毒灵珠长杖
Array(1382047, 100, 1, 1), //冰灵珠长杖
Array(1382048, 100, 1, 1), //雷灵珠长杖
Array(1382049, 100, 1, 1), //朱雀长杖
Array(1382050, 100, 1, 1), //玄武长杖
Array(1382051, 100, 1, 1), //白虎长杖
Array(1382052, 100, 1, 1), //青龙长杖
Array(1382057, 100, 1, 1), //永恒冰轮杖
Array(1382059, 100, 1, 1), //重生冰轮杖
Array(1402013, 600, 1, 1), //白日剑
Array(1402014, 300, 1, 1), //温度计
Array(1402015, 100, 1, 0), //亚历山大之剑
Array(1402016, 100, 1, 0), //所罗门之剑
Array(1402034, 300, 1, 0), //亚历山大之剑
Array(1402035, 300, 1, 0), //斩天刀
Array(1402036, 300, 1, 1), //飞龙巨剑
Array(1402037, 150, 1, 1), //龙背刃
Array(1402039, 300, 1, 0), //枫叶枭首剑
Array(1402040, 300, 1, 0), //枫叶3年旗
Array(1402041, 300, 1, 0), //粉色花边游泳圈
Array(1402044, 300, 1, 0), //南瓜灯笼
Array(1402046, 300, 1, 1), //永恒玄冥剑
Array(1402047, 300, 1, 1), //重生玄冥剑
Array(1412025, 600, 1, 0), //大力神之斧
Array(1412026, 600, 1, 0), //炼狱魔龙斧
Array(1412027, 600, 1, 0), //枫叶乾坤轮
Array(1412028, 600, 1, 0), //枫叶3年旗
Array(1412029, 600, 1, 0), //粉色花边游泳圈
Array(1412033, 100, 1, 1), //永恒碎鼋斧
Array(1412034, 100, 1, 1), //重生碎鼋斧
Array(1422028, 600, 1, 0), //金龙轰天锤
Array(1422029, 600, 1, 0), //枫叶轰天镗
Array(1422030, 100, 1, 0), //粉红海豹抱枕
Array(1422031, 100, 1, 0), //蓝色海豹抱枕
Array(1422032, 600, 1, 0), //枫叶3年旗
Array(1422033, 600, 1, 0), //粉色花边游泳圈
Array(1422036, 600, 1, 0), //玩具匠人的锤子
Array(1422037, 100, 1, 1), //永恒威震天
Array(1422038, 100, 1, 1), //重生威震天
Array(1432009, 100, 1, 0), //木精灵枪
Array(1432010, 100, 1, 0), //奥丁手戟
Array(1432011, 100, 1, 0), //寒冰破魔枪
Array(1432012, 100, 1, 0), //枫叶枪
Array(1432013, 100, 1, 0), //南瓜枪
Array(1432014, 100, 1, 0), //海神叉
Array(1432015, 100, 1, 0), //红色滑雪板
Array(1432016, 100, 1, 0), //橙色滑雪板
Array(1432017, 100, 1, 0), //绿色滑雪板
Array(1432018, 100, 1, 0), //蓝色滑雪板
Array(1432030, 100, 1, 1), //红莲落神枪
Array(1432031, 100, 1, 0), //三支枪
Array(1432032, 100, 1, 0), //长八蛇矛
Array(1432033, 100, 1, 0), //十字枪
Array(1432034, 100, 1, 0), //银龙枪
Array(1432035, 100, 1, 0), //奥丁手戟
Array(1432037, 100, 1, 0), //枫叶大将旗
Array(1432038, 300, 1, 1), //盘龙七冲枪
Array(1432039, 100, 1, 0), //钓鱼竿
Array(1432040, 100, 1, 0), //枫叶钻天枪
Array(1432047, 100, 1, 1), //永恒显圣枪
Array(1432048, 100, 1, 0), //铲子
Array(1432049, 100, 1, 1), //重生显圣枪
Array(1452057, 100, 1, 1), //永恒惊电弓
Array(1452059, 100, 1, 1), //重生惊电弓
Array(1462018, 100, 1, 1), //红炎神机弩
Array(1462039, 100, 1, 0), //黄金飞龙弩
Array(1462050, 100, 1, 0), //永恒冥雷弩
Array(1462051, 100, 1, 0), //重生冥雷弩
Array(1462040, 600, 1, 0), //枫叶击星弩
Array(1462041, 600, 1, 0), //枫叶3年旗
Array(1462043, 600, 1, 0), //粉色花边游泳圈
Array(1462050, 100, 1, 1), //永恒冥雷弩
Array(1462051, 100, 1, 1), //重生冥雷弩
Array(1472051, 600, 1, 1), //寒木升龙拳
Array(1472052, 600, 1, 1), //碧水落龙拳
Array(1472053, 600, 1, 1), //逆龙咆哮拳
//------药水------
Array(1132010, 200, 1, 1), //黄金猪猪腰带
Array(1132011, 100, 1, 1), //黄金猪猪腰带
Array(1132012, 100, 1, 1), //法老的腰带
Array(1132013, 100, 1, 1), //不灭的法老腰带
Array(1012011, 100, 1, 0), //圣诞鹿的鼻子
Array(1012012, 100, 1, 0), //圣诞鹿的鼻子
Array(1012013, 100, 1, 0), //圣诞鹿的鼻子
Array(1012014, 100, 1, 0), //圣诞鹿的鼻子
Array(1012015, 100, 1, 0), //圣诞鹿的鼻子
Array(1012016, 100, 1, 0), //圣诞鹿的鼻子
Array(1012017, 100, 1, 0), //圣诞鹿的鼻子
Array(1012018, 100, 1, 0), //圣诞鹿的鼻子
Array(1012019, 100, 1, 0), //圣诞鹿的鼻子
Array(1012020, 100, 1, 0), //圣诞鹿的鼻子
Array(1012056, 100, 1, 1), //狗狗鼻
Array(1012058, 100, 1, 1), //匹诺曹的鼻子
Array(1012059, 100, 1, 1), //匹诺曹的鼻子
Array(1012060, 100, 1, 1), //匹诺曹的鼻子
Array(1012061, 100, 1, 1), //匹诺曹的鼻子
Array(2340000, 50, 1, 0), //祝福卷轴
Array(2040000, 500, 1, 0), //头盔防御卷轴 成功率100%
Array(2040001, 500, 1, 0), //头盔防御卷轴60%
Array(2040002, 500, 1, 0), //头盔防御卷轴10%
Array(2040003, 500, 1, 0), //头盔体力卷轴100%
Array(2040004, 500, 1, 0), //头盔体力卷轴60%
Array(2040005, 500, 1, 0), //头盔体力卷轴10%
Array(2040008, 500, 1, 0), //头盔防御诅咒卷轴70%
Array(2040009, 500, 1, 0), //头盔防御诅咒卷轴30%
Array(2040010, 500, 1, 0), //头盔体力诅咒卷轴70%
Array(2040011, 500, 1, 0), //头盔体力诅咒卷轴30%
Array(2040012, 500, 1, 1), //头盔智力卷轴70%
Array(2040013, 500, 1, 1), //头盔智力卷轴30%
Array(2040014, 500, 1, 0), //头盔命中率诅咒卷轴70%
Array(2040015, 500, 1, 0), //头盔命中率诅咒卷轴30%
Array(2040016, 500, 1, 0), //头盔命中率卷轴10%
Array(2040017, 500, 1, 0), //头盔命中率卷轴60%
Array(2040018, 500, 1, 0), //头盔命中率卷轴100%
Array(2040019, 500, 1, 0), //头盔防御卷轴65%
Array(2040020, 500, 1, 0), //头盔防御卷轴15%
Array(2040021, 500, 1, 0), //头盔体力卷轴65%
Array(2040022, 500, 1, 0), //头盔体力卷轴15%
Array(2040024, 500, 1, 0), //头盔智力卷轴100%
Array(2040025, 500, 1, 0), //头盔智力卷轴60%
Array(2040026, 500, 1, 1), //头盔智力卷轴10%
Array(2040027, 500, 1, 0), //头盔敏捷卷轴100%
Array(2040028, 500, 1, 0), //头盔敏捷卷轴70%
Array(2040029, 500, 1, 0), //头盔敏捷卷轴60%
Array(2040030, 500, 1, 0), //头盔敏捷卷轴30%
Array(2040031, 500, 1, 1), //头盔敏捷卷轴10%
Array(2040100, 500, 1, 0), //脸部装饰生命卷轴10%
Array(2040101, 500, 1, 0), //脸部装饰生命卷轴60%
Array(2040103, 500, 1, 0), //脸部装饰生命诅咒卷轴30%
Array(2040104, 500, 1, 0), //脸部装饰生命诅咒卷轴70%
Array(2040105, 500, 1, 1), //脸部装饰回避率卷轴10%
Array(2040106, 500, 1, 0), //脸部装饰回避率卷轴60%
Array(2040108, 500, 1, 0), //脸部装饰回避率诅咒卷轴30%
Array(2040109, 500, 1, 0), //脸部装饰回避率诅咒卷轴70%
Array(2040200, 200, 1, 1), //眼部装饰命中率卷轴10%
Array(2040201, 200, 1, 1), //眼部装饰命中率卷轴60%
Array(2040203, 200, 1, 1), //眼部装饰命中率诅咒卷轴30%
Array(2040204, 200, 1, 1), //眼部装饰命中率诅咒卷轴70%
Array(2040205, 200, 1, 1), //眼部装饰智力卷轴10%
Array(2040206, 200, 1, 1), //眼部装饰智力卷轴60%
Array(2040208, 200, 1, 1), //眼部装饰智力诅咒卷轴30%
Array(2040209, 200, 1, 1), //眼部装饰智力诅咒卷轴70%
Array(2040300, 100, 1, 0), //耳环智力卷轴100%
Array(2040301, 100, 1, 0), //耳环智力卷轴60%
Array(2040302, 150, 1, 1), //耳环智力卷轴10%
Array(2040304, 100, 1, 0), //耳环智力诅咒卷轴70%
Array(2040305, 100, 1, 0), //耳环智力诅咒卷轴30%
Array(2040306, 200, 1, 0), //耳环敏捷卷轴70%
Array(2040307, 200, 1, 0), //耳环敏捷卷轴30%
Array(2040308, 500, 1, 0), //耳环防御力诅咒卷轴70%
Array(2040309, 500, 1, 0), //耳环防御力诅咒卷轴30%
Array(2040310, 500, 1, 0), //耳环防御力卷轴10%
Array(2040311, 500, 1, 0), //耳环防御力卷轴60%
Array(2040312, 500, 1, 0), //耳环防御力卷轴100%
Array(2040313, 100, 1, 1), //耳环智力卷轴65%
Array(2040314, 200, 1, 1), //耳环智力卷轴15%
Array(2040316, 100, 1, 0), //耳环敏捷卷轴100%
Array(2040317, 100, 1, 0), //耳环敏捷卷轴60%
Array(2040318, 200, 1, 1), //耳环敏捷卷轴10%
Array(2040319, 200, 1, 0), //耳环装饰运气卷轴100%
Array(2040320, 200, 1, 0), //耳环运气卷轴70%
Array(2040321, 200, 1, 0), //耳环装饰运气卷轴60%
Array(2040322, 200, 1, 0), //耳环装饰运气卷轴30%
Array(2040323, 100, 1, 1), //耳环运气卷轴10%
Array(2040324, 500, 1, 0), //耳环装饰体力卷轴100%
Array(2040325, 600, 1, 0), //耳环装饰体力卷轴70%
Array(2040326, 100, 1, 0), //耳环装饰体力卷轴60%
Array(2040327, 100, 1, 0), //耳环装饰体力卷轴30%
Array(2040328, 100, 1, 0), //耳环装饰体力卷轴10%
Array(2040400, 500, 1, 0), //上衣防御卷轴100%
Array(2040401, 500, 1, 0), //上衣防御卷轴60%
Array(2040402, 500, 1, 0), //上衣防御卷轴10%
Array(2040404, 500, 1, 0), //上衣防御诅咒卷轴70%
Array(2040405, 500, 1, 0), //上衣防御诅咒卷轴30%
Array(2040406, 500, 1, 0), //上衣力量卷轴70%
Array(2040407, 500, 1, 0), //上衣力量卷轴30%
Array(2040408, 500, 1, 0), //上衣体力卷轴70%
Array(2040409, 500, 1, 0), //上衣体力卷轴30%
Array(2040410, 600, 1, 0), //上衣运气诅咒卷轴70%
Array(2040411, 600, 1, 0), //上衣运气诅咒卷轴30%
Array(2040412, 600, 1, 0), //上衣运气卷轴10%
Array(2040413, 600, 1, 0), //上衣运气卷轴60%
Array(2040414, 500, 1, 0), //上衣运气卷轴100%
Array(2040415, 500, 1, 0), //上衣防御力卷轴65%
Array(2040416, 500, 1, 0), //上衣防御力卷轴15%
Array(2040417, 500, 1, 0), //上衣力量卷轴100%
Array(2040418, 500, 1, 0), //上衣力量卷轴60%
Array(2040419, 500, 1, 0), //上衣力量卷轴10%
Array(2040420, 500, 1, 0), //上衣体力卷轴100%
Array(2040421, 500, 1, 0), //上衣体力卷轴60%
Array(2040422, 500, 1, 0), //上衣体力卷轴10%
Array(2040423, 500, 1, 0), //上衣运气卷轴100%
Array(2040424, 500, 1, 0), //上衣运气卷轴70%
Array(2040425, 500, 1, 0), //上衣运气卷轴60%
Array(2040426, 500, 1, 0), //上衣运气卷轴30%
Array(2040427, 500, 1, 0), //上衣运气卷轴10%
Array(2040500, 500, 1, 0), //全身铠甲敏捷卷轴100%
Array(2040501, 200, 1, 0), //全身铠甲敏捷卷轴60%
Array(2040502, 100, 1, 1), //全身铠甲敏捷卷轴10%
Array(2040503, 600, 1, 0), //全身铠甲防御卷轴100%
Array(2040504, 100, 1, 0), //全身铠甲防御卷轴60%
Array(2040505, 200, 1, 0), //全身铠甲防御卷轴10%
Array(2040508, 600, 1, 0), //全身铠甲敏捷诅咒卷轴70%
Array(2040509, 600, 1, 0), //全身铠甲敏捷诅咒卷轴30%
Array(2040510, 600, 1, 0), //全身铠甲防御诅咒卷轴70%
Array(2040511, 600, 1, 0), //全身铠甲防御诅咒卷轴70%
Array(2040512, 600, 1, 0), //全身铠甲智力卷轴100%
Array(2040513, 600, 1, 0), //全身铠甲智力卷轴60%
Array(2040514, 200, 1, 0), //全身铠甲智力卷轴10%
Array(2040515, 400, 1, 1), //全身铠甲运气卷轴100%
Array(2040516, 400, 1, 0), //全身铠甲运气卷轴60%
Array(2040517, 600, 1, 0), //全身铠甲运气卷轴10%
Array(2040518, 400, 1, 0), //全身盔甲智力卷轴70%
Array(2040519, 400, 1, 0), //全身盔甲智力卷轴30%
Array(2040520, 400, 1, 0), //全身盔甲幸运卷轴70%
Array(2040521, 400, 1, 0), //全身盔甲幸运卷轴30%
Array(2040522, 400, 1, 0), //全身盔甲敏捷卷轴65%
Array(2040523, 600, 1, 0), //全身盔甲敏捷卷轴15%
Array(2040524, 400, 1, 0), //全身盔甲防御卷轴65%
Array(2040525, 400, 1, 0), //全身盔甲防御卷轴15%
Array(2040526, 600, 1, 0), //全身盔甲智力卷轴65%
Array(2040527, 400, 1, 0), //全身盔甲智力卷轴15%
Array(2040528, 600, 1, 0), //全身盔甲幸运卷轴65%
Array(2040529, 400, 1, 0), //全身盔甲幸运卷轴15%
Array(2040530, 500, 1, 0), //全身盔甲力量卷轴100%
Array(2040531, 400, 1, 0), //全身盔甲力量卷轴70%
Array(2040532, 400, 1, 0), //全身盔甲力量卷轴60%
Array(2040533, 400, 1, 0), //全身盔甲力量卷轴30%
Array(2040534, 600, 1, 1), //全身盔甲力量卷轴10%
Array(2040600, 500, 1, 0), //裤/裙防御卷轴100%
Array(2040601, 500, 1, 0), //裤/裙防御卷轴60%
Array(2040602, 500, 1, 0), //裤/裙防御卷轴10%
Array(2040604, 500, 1, 0), //裤/裙防御诅咒卷轴70%
Array(2040605, 500, 1, 0), //裤/裙防御诅咒卷轴30%
Array(2040606, 500, 1, 0), //裤裙跳跃诅咒卷轴70%
Array(2040607, 500, 1, 0), //裤裙跳跃诅咒卷轴30%
Array(2040608, 500, 1, 0), //裤裙体力诅咒卷轴70%
Array(2040609, 500, 1, 0), //裤裙体力诅咒卷轴30%
Array(2040610, 500, 1, 0), //裤裙敏捷诅咒卷轴70%
Array(2040611, 500, 1, 0), //裤裙敏捷诅咒卷轴30%
Array(2040612, 500, 1, 0), //裤裙敏捷卷轴10%
Array(2040613, 500, 1, 0), //裤裙敏捷卷轴60%
Array(2040614, 500, 1, 0), //裤裙敏捷卷轴100%
Array(2040615, 500, 1, 0), //裤裙防御卷轴65%
Array(2040616, 500, 1, 0), //裤裙防御卷轴15%
Array(2040617, 500, 1, 0), //裤裙跳跃卷轴100%
Array(2040618, 500, 1, 0), //裤裙跳跃卷轴60%
Array(2040619, 500, 1, 0), //裤裙跳跃卷轴10%
Array(2040620, 500, 1, 0), //裤裙体力卷轴100%
Array(2040621, 500, 1, 0), //裤裙体力卷轴60%
Array(2040622, 500, 1, 0), //裤裙体力卷轴10%
Array(2040623, 600, 1, 0), //裤裙敏捷卷轴100%
Array(2040624, 600, 1, 0), //裤裙敏捷卷轴70%
Array(2040625, 600, 1, 0), //裤裙敏捷卷轴60%
Array(2040626, 600, 1, 0), //裤裙敏捷卷轴30%
Array(2040627, 200, 1, 0), //裤裙敏捷卷轴10%
Array(2040700, 200, 1, 0), //鞋子敏捷度卷轴100%
Array(2040701, 600, 1, 0), //鞋子敏捷度卷轴60%
Array(2040800, 600, 1, 1), //手套敏捷卷轴100%
Array(2040801, 400, 1, 1), //手套敏捷卷轴60%
Array(2040802, 600, 1, 1), //手套敏捷卷轴10%
Array(2040803, 100, 1, 1), //手套攻击卷轴100%
Array(2040804, 400, 1, 1), //手套攻击卷轴60%
Array(2040805, 200, 1, 1), //手套攻击卷轴10%
Array(2040808, 500, 1, 0), //手套敏捷诅咒卷轴70%
Array(2040809, 500, 1, 0), //手套敏捷诅咒卷轴30%
Array(2040810, 100, 1, 1), //手套攻击诅咒卷轴70%
Array(2040811, 100, 1, 1), //手套攻击诅咒卷轴30%
Array(2040812, 500, 1, 0), //手套体力卷轴70%
Array(2040813, 500, 1, 0), //手套体力卷轴30%
Array(2040814, 500, 1, 0), //手套魔力诅咒卷轴70%
Array(2040815, 500, 1, 0), //手套魔力诅咒卷轴30%
Array(2040816, 500, 1, 0), //手套魔力卷轴10%
Array(2040817, 500, 1, 0), //手套魔力卷轴60%
Array(2040818, 500, 1, 0), //手套魔力卷轴100%
Array(2040819, 500, 1, 0), //手套敏捷卷轴65%
Array(2040820, 500, 1, 0), //手套敏捷卷轴15%
Array(2040821, 600, 1, 1), //手套攻击卷轴65%
Array(2040822, 600, 1, 1), //手套攻击卷轴15%
Array(2040823, 200, 1, 0), //手套体力卷轴100%
Array(2040824, 500, 1, 0), //手套体力卷轴60%
Array(2040825, 500, 1, 0), //手套体力卷轴10%
Array(2040900, 500, 1, 0), //盾牌防御卷轴
Array(2040901, 500, 1, 0), //盾牌防御卷轴60%
Array(2040902, 500, 1, 0), //盾牌防御卷轴10%
Array(2040904, 500, 1, 0), //盾牌防御诅咒卷轴70%
Array(2040905, 500, 1, 0), //盾牌防御诅咒卷轴30%
Array(2040906, 500, 1, 0), //盾牌运气卷轴70%
Array(2040907, 500, 1, 0), //盾牌运气卷轴30%
Array(2040908, 500, 1, 0), //盾牌体力卷轴70%
Array(2040909, 500, 1, 0), //盾牌体力卷轴30%
Array(2040910, 500, 1, 0), //盾牌防御卷轴65%
Array(2040911, 500, 1, 0), //盾牌防御卷轴15%
Array(2040914, 600, 1, 0), //盾牌攻击卷轴60%
Array(2040915, 600, 1, 0), //盾牌攻击卷轴10%
Array(2040916, 400, 1, 0), //盾牌攻击诅咒卷轴70%
Array(2040917, 200, 1, 0), //盾牌攻击诅咒卷轴30%
Array(2040919, 200, 1, 0), //盾牌魔力卷轴60%
Array(2040920, 600, 1, 0), //盾牌魔力卷轴10%
Array(2040921, 600, 1, 0), //盾牌魔力诅咒卷轴70%
Array(2040922, 400, 1, 0), //盾牌魔力诅咒卷轴30%
Array(2040923, 200, 1, 0), //盾牌运气卷轴100%
Array(2040924, 600, 1, 0), //盾牌运气卷轴60%
Array(2040925, 400, 1, 0), //盾牌运气卷轴10%
Array(2040926, 800, 1, 0), //盾牌体力卷轴100%
Array(2040927, 800, 1, 0), //盾牌体力卷轴60%
Array(2040928, 800, 1, 0), //盾牌体力卷轴10%
Array(2040929, 400, 1, 0), //盾牌力量卷轴100%
Array(2040930, 600, 1, 0), //盾牌力量卷轴70%
Array(2040931, 200, 1, 0), //盾牌力量卷轴60%
Array(2040932, 100, 1, 0), //盾牌力量卷轴30%
Array(2040933, 600, 1, 0), //盾牌力量卷轴10%
Array(2041009, 600, 1, 0), //披风魔力卷轴100%
Array(2041010, 600, 1, 0), //披风魔力卷轴60%
Array(2041011, 600, 1, 0), //披风魔力卷轴10%
Array(2041012, 600, 1, 0), //披风力量卷轴100%
Array(2041013, 600, 1, 0), //披风力量卷轴60%
Array(2041014, 600, 1, 0), //披风力量卷轴10%
Array(2041015, 340, 1, 0), //披风智力卷轴100%
Array(2041016, 600, 1, 0), //披风智力卷轴60%
Array(2041017, 600, 1, 0), //披风智力卷轴10%
Array(2041018, 600, 1, 0), //披风敏捷卷轴100%
Array(2041019, 600, 1, 0), //披风敏捷卷轴60%
Array(2041020, 600, 1, 0), //披风敏捷卷轴10%
Array(2041021, 600, 1, 0), //披风运气卷轴100%
Array(2041022, 600, 1, 0), //披风运气卷轴60%
Array(2041023, 600, 1, 0), //披风运气卷轴10%
Array(2041026, 600, 1, 0), //披风魔防诅咒卷轴70%
Array(2041027, 600, 1, 0), //披风魔防诅咒卷轴30%
Array(2041028, 600, 1, 0), //披风防御诅咒卷轴70%
Array(2041029, 600, 1, 0), //披风防御诅咒卷轴30%
Array(2041030, 600, 1, 0), //披风体力诅咒卷轴70%
Array(2041031, 600, 1, 0), //披风体力诅咒卷轴30%
Array(2041032, 600, 1, 0), //披风魔力诅咒卷轴70%
Array(2041033, 600, 1, 0), //披风魔力诅咒卷轴30%
Array(2041034, 600, 1, 0), //披风力量诅咒卷轴70%
Array(2041035, 600, 1, 0), //披风力量诅咒卷轴30%
Array(2041036, 600, 1, 0), //披风智力诅咒卷轴70%
Array(2041037, 600, 1, 0), //披风智力诅咒卷轴30%
Array(2041038, 600, 1, 0), //披风敏捷诅咒卷轴70%
Array(2041039, 600, 1, 0), //披风敏捷诅咒卷轴30%
Array(2041040, 600, 1, 0), //披风运气诅咒卷轴70%
Array(2041041, 600, 1, 0), //披风运气诅咒卷轴30%
Array(2041042, 600, 1, 0), //披风魔法防御卷轴65%
Array(2041043, 600, 1, 0), //披风魔法防御卷轴15%
Array(2041044, 600, 1, 0), //披风物理防御卷轴65%
Array(2041045, 600, 1, 0), //披风物理防御卷轴15%
Array(2041046, 600, 1, 0), //披风体力卷轴65%
Array(2041047, 600, 1, 0), //披风体力卷轴15%
Array(2041048, 600, 1, 0), //披风魔力卷轴65%
Array(2041049, 600, 1, 0), //披风魔力卷轴15%
Array(2041050, 600, 1, 0), //披风力卷轴65%
Array(2041051, 600, 1, 0), //披风力卷轴15%
Array(2041052, 600, 1, 0), //披风智力卷轴65%
Array(2041053, 600, 1, 0), //披风智力卷轴15%
Array(2041054, 600, 1, 0), //披风敏捷卷轴65%
Array(2041055, 600, 1, 0), //披风敏捷卷轴15%
Array(2041056, 600, 1, 0), //披风幸运卷轴65%
Array(2041057, 600, 1, 1), //披风幸运卷轴15%
Array(2041058, 600, 1, 1), //披风防寒卷轴10%
Array(2041201, 600, 1, 1), //项链运气卷轴10%
Array(2041202, 600, 1, 1), //项链运气卷轴60%
Array(2041203, 600, 1, 1), //项链运气卷轴100%
Array(2041204, 600, 1, 1), //项链运气诅咒卷轴30%
Array(2041205, 600, 1, 1), //项链运气诅咒卷轴70%
Array(2041206, 600, 1, 1), //项链力量卷轴10%
Array(2041207, 600, 1, 1), //项链力量卷轴60%
Array(2041208, 600, 1, 1), //项链力量卷轴100%
Array(2041209, 600, 1, 1), //项链力量诅咒卷轴30%
Array(2041210, 600, 1, 1), //项链力量诅咒卷轴70%
Array(2041301, 600, 1, 0), //腰带力量卷轴60%
Array(2041304, 600, 1, 0), //腰带智力卷轴60%
Array(2041307, 600, 1, 0), //腰带敏捷卷轴60%
Array(2041310, 600, 1, 0), //腰带运气卷轴60%
Array(2043000, 600, 1, 0), //单手剑攻击卷轴100%
Array(2043001, 600, 1, 0), //单手剑攻击卷轴60%
Array(2043002, 600, 1, 0), //单手剑攻击卷轴10%
Array(2043004, 600, 1, 0), //单手剑攻击诅咒卷轴70%
Array(2043005, 600, 1, 0), //单手剑攻击诅咒卷轴30%
Array(2043006, 600, 1, 0), //单手剑魔力诅咒卷轴70%
Array(2043007, 600, 1, 0), //单手剑魔力诅咒卷轴30%
Array(2043008, 600, 1, 0), //单手剑魔力卷轴10%
Array(2043009, 600, 1, 0), //单手剑魔力卷轴60%
Array(2043010, 600, 1, 0), //单手剑魔力卷轴100%
Array(2043011, 600, 1, 0), //单手剑攻击卷轴65%
Array(2043012, 600, 1, 0), //单手剑攻击卷轴15%
Array(2043015, 600, 1, 0), //单手剑命中率卷轴100%
Array(2043016, 600, 1, 0), //单手剑命中率卷轴70%
Array(2043017, 600, 1, 0), //单手剑命中率卷轴60%
Array(2043018, 600, 1, 0), //单手剑命中率卷轴30%
Array(2043019, 600, 1, 0), //单手剑命中率卷轴10%
Array(2043024, 600, 1, 0), //单手剑命中卷轴65%
Array(2043025, 600, 1, 0), //单手剑命中卷轴15%
Array(2043100, 600, 1, 0), //单手斧攻击卷轴100%
Array(2043101, 600, 1, 0), //单手斧攻击卷轴60%
Array(2043102, 600, 1, 0), //单手斧攻击卷轴10%
Array(2043104, 400, 1, 0), //单手斧攻击诅咒卷轴70%
Array(2043105, 400, 1, 0), //单手斧攻击诅咒卷轴30%
Array(2043106, 400, 1, 0), //单手斧攻击卷轴65%
Array(2043107, 400, 1, 0), //单手斧攻击卷轴15%
Array(2043110, 400, 1, 0), //单手斧命中率卷轴100%
Array(2043111, 400, 1, 0), //单手斧命中率卷轴70%
Array(2043112, 400, 1, 0), //单手斧命中率卷轴60%
Array(2043113, 400, 1, 0), //单手斧命中率卷轴30%
Array(2043114, 400, 1, 0), //单手斧命中率卷轴10%
Array(2043118, 400, 1, 0), //单手斧命中卷轴65%
Array(2043119, 400, 1, 0), //单手斧命中卷轴15%
Array(2043200, 400, 1, 0), //单手钝器攻击卷轴100%
Array(2043201, 400, 1, 0), //单手钝器攻击卷轴60%
Array(2043202, 400, 1, 0), //单手钝器攻击卷轴10%
Array(2043204, 400, 1, 0), //单手钝器攻击诅咒卷轴70%
Array(2043205, 400, 1, 0), //单手钝器攻击诅咒卷轴30%
Array(2043206, 400, 1, 0), //单手钝器攻击卷轴65%
Array(2043207, 400, 1, 0), //单手钝器攻击卷轴15%
Array(2043210, 400, 1, 0), //单手钝器命中率卷轴100%
Array(2043211, 400, 1, 0), //单手钝器命中率卷轴70%
Array(2043212, 400, 1, 0), //单手钝器命中率卷轴60%
Array(2043213, 400, 1, 0), //单手钝器命中率卷轴30%
Array(2043214, 400, 1, 0), //单手钝器命中率卷轴10%
Array(2043218, 400, 1, 0), //单手钝器命中卷轴65%
Array(2043219, 400, 1, 0), //单手钝器命中卷轴15%
Array(2043300, 450, 1, 0), //短剑攻击卷轴100%
Array(2043301, 400, 1, 0), //短剑攻击卷轴60%
Array(2043302, 400, 1, 0), //短剑攻击卷轴10%
Array(2043304, 400, 1, 0), //短剑攻击诅咒卷轴70%
Array(2043305, 400, 1, 0), //短剑攻击诅咒卷轴30%
Array(2043306, 400, 1, 0), //短剑攻击卷轴65%
Array(2043307, 400, 1, 0), //短剑攻击卷轴15%
Array(2043700, 400, 1, 0), //短杖魔力卷轴100%
Array(2043701, 400, 1, 0), //短杖魔力卷轴60%
Array(2043702, 400, 1, 0), //短杖魔力卷轴10%
Array(2043704, 400, 1, 0), //短杖魔力诅咒卷轴70%
Array(2043705, 400, 1, 0), //短杖魔力诅咒卷轴30%
Array(2043706, 400, 1, 0), //短杖魔力卷轴65%
Array(2043707, 400, 1, 0), //短杖魔力卷轴15%
Array(2043800, 400, 1, 0), //长杖魔力卷轴100%
Array(2043801, 400, 1, 0), //长杖魔力卷轴60%
Array(2043802, 600, 1, 0), //长杖魔力卷轴10%
Array(2043804, 600, 1, 0), //长杖魔力诅咒卷轴70%
Array(2043805, 600, 1, 0), //长杖魔力诅咒卷轴30%
Array(2043806, 600, 1, 0), //长杖魔力卷轴65%
Array(2043807, 600, 1, 0), //长杖魔力卷轴15%
Array(2044000, 500, 1, 1), //双手剑攻击卷轴100%
Array(2044001, 600, 1, 1), //双手剑攻击卷轴60%
Array(2044002, 600, 1, 1), //双手剑攻击卷轴10%
Array(2044004, 400, 1, 1), //双手剑攻击诅咒卷轴70%
Array(2044005, 600, 1, 1), //双手剑攻击诅咒卷轴30%
Array(2044006, 600, 1, 1), //双手剑攻击卷轴65%
Array(2044007, 600, 1, 1), //双手剑攻击卷轴15%
Array(2044010, 600, 1, 0), //双手剑命中率卷轴100%
Array(2044011, 600, 1, 0), //双手剑命中率卷轴70%
Array(2044012, 600, 1, 0), //双手剑命中率卷轴60%
Array(2044013, 600, 1, 0), //双手剑命中率卷轴30%
Array(2044014, 600, 1, 0), //双手剑命中率卷轴10%
Array(2044026, 600, 1, 0), //双手剑命中卷轴65%
Array(2044027, 600, 1, 0), //双手剑命中卷轴15%
Array(2044100, 600, 1, 0), //双手斧攻击卷轴100%
Array(2044101, 600, 1, 0), //双手斧攻击卷轴60%
Array(2044102, 600, 1, 0), //双手斧攻击卷轴10%
Array(2044104, 600, 1, 0), //双手斧攻击诅咒卷轴70%
Array(2044105, 600, 1, 0), //双手斧攻击诅咒卷轴%30
Array(2044106, 600, 1, 0), //双手斧攻击卷轴65%
Array(2044107, 600, 1, 0), //双手斧攻击卷轴15%
Array(2044110, 600, 1, 0), //双手斧命中率卷轴100%
Array(2044111, 600, 1, 0), //双手斧命中率卷轴70%
Array(2044112, 600, 1, 0), //双手斧命中率卷轴60%
Array(2044113, 600, 1, 0), //双手斧命中率卷轴30%
Array(2044114, 600, 1, 0), //双手斧命中率卷轴10%
Array(2044118, 600, 1, 0), //双手斧命中卷轴65%
Array(2044119, 600, 1, 0), //双手斧命中卷轴15%
Array(2044200, 600, 1, 0), //双手钝器攻击卷轴100%
Array(2044201, 600, 1, 0), //双手钝器攻击卷轴60%
Array(2044202, 600, 1, 0), //双手钝器攻击卷轴10%
Array(2044204, 600, 1, 0), //双手钝器攻击诅咒卷轴70%
Array(2044205, 600, 1, 0), //双手钝器攻击诅咒卷轴30%
Array(2044206, 600, 1, 0), //双手钝器攻击卷轴65%
Array(2044207, 600, 1, 0), //双手钝器攻击卷轴15%
Array(2044210, 600, 1, 0), //双手钝器命中率卷轴100%
Array(2044211, 600, 1, 0), //双手钝器命中率卷轴70%
Array(2044212, 600, 1, 0), //双手钝器命中率卷轴60%
Array(2044213, 600, 1, 0), //双手钝器命中率卷轴30%
Array(2044214, 600, 1, 0), //双手钝器命中率卷轴10%
Array(2044218, 600, 1, 0), //单手钝器命中卷轴65%
Array(2044219, 600, 1, 0), //单手钝器命中卷轴15%
Array(2044300, 600, 1, 1), //枪攻击卷轴100%
Array(2044301, 600, 1, 1), //枪攻击卷轴60%
Array(2044302, 600, 1, 1), //枪攻击卷轴10%
Array(2044304, 600, 1, 1), //枪攻击诅咒卷轴70%
Array(2044305, 600, 1, 1), //枪攻击诅咒卷轴30%
Array(2044306, 600, 1, 1), //枪攻击卷轴65%
Array(2044307, 600, 1, 1), //枪攻击卷轴15%
Array(2044310, 600, 1, 0), //枪命中率卷轴100%
Array(2044311, 600, 1, 0), //枪命中率卷轴70%
Array(2044312, 600, 1, 0), //枪命中率卷轴60%
Array(2044313, 600, 1, 0), //枪命中率卷轴30%
Array(2044314, 600, 1, 0), //枪命中率卷轴10%
Array(2044318, 600, 1, 0), //枪命中卷轴65%
Array(2044319, 600, 1, 0), //枪命中卷轴15%
Array(2044400, 600, 1, 1), //矛攻击卷轴100%
Array(2044401, 600, 1, 1), //矛攻击卷轴60%
Array(2044402, 600, 1, 1), //矛攻击卷轴10%
Array(2044404, 600, 1, 1), //矛攻击诅咒卷轴70%
Array(2044405, 600, 1, 1), //矛攻击诅咒卷轴30%
Array(2044406, 600, 1, 1), //矛攻击卷轴65%
Array(2044407, 600, 1, 1), //矛攻击卷轴15%
Array(2044410, 600, 1, 0), //矛命中率卷轴100%
Array(2044411, 600, 1, 0), //矛命中率卷轴70%
Array(2044412, 600, 1, 0), //矛命中率卷轴60%
Array(2044413, 600, 1, 0), //矛命中率卷轴30%
Array(2044414, 600, 1, 0), //矛命中率卷轴10%
Array(2044418, 600, 1, 0), //矛命中卷轴65%
Array(2044419, 600, 1, 0), //矛命中卷轴15%
Array(2044500, 600, 1, 0), //弓攻击卷轴100%
Array(2044501, 600, 1, 0), //弓攻击卷轴60%
Array(2044502, 600, 1, 0), //弓攻击卷轴10%
Array(2044504, 600, 1, 0), //弓攻击诅咒卷轴70%
Array(2044505, 600, 1, 0), //弓攻击诅咒卷轴30%
Array(2044506, 600, 1, 0), //弓攻击卷轴65%
Array(2044507, 600, 1, 0), //弓攻击卷轴15%
Array(2044600, 600, 1, 0), //弩攻击卷轴100%
Array(2044601, 600, 1, 0), //弩攻击卷轴60%
Array(2044602, 600, 1, 0), //弩攻击卷轴10%
Array(2044604, 600, 1, 0), //弩攻击诅咒卷轴70%
Array(2044605, 600, 1, 0), //弩攻击诅咒卷轴30%
Array(2044606, 500, 1, 0), //弩攻击卷轴65%
Array(2044607, 500, 1, 0), //弩攻击卷轴15%
Array(2044700, 400, 1, 0), //拳套攻击卷轴100%
Array(2044701, 200, 1, 0), //拳套攻击卷轴60%
Array(2044702, 600, 1, 0), //拳套攻击卷轴10%
Array(2044704, 600, 1, 0), //拳套攻击诅咒卷轴70%
Array(2044705, 600, 1, 0), //拳套攻击诅咒卷轴30%
Array(2044706, 600, 1, 0), //拳套攻击卷轴65%
Array(2044707, 600, 1, 0), //拳套攻击卷轴15%
Array(2044800, 600, 1, 0), //拳甲攻击卷轴100%
Array(2044801, 600, 1, 0), //拳甲攻击卷轴60%
Array(2044802, 600, 1, 0), //拳甲攻击卷轴10%
Array(2044803, 600, 1, 0), //拳甲攻击卷轴70%
Array(2044804, 600, 1, 0), //拳甲攻击卷轴30%
Array(2044805, 600, 1, 0), //拳甲命中率卷轴100%
Array(2044806, 600, 1, 0), //拳甲命中率卷轴70%
Array(2044807, 600, 1, 0), //拳甲命中率卷轴60%
Array(2044808, 600, 1, 0), //拳甲命中率卷轴30%
Array(2044809, 600, 1, 0), //拳甲命中率卷轴10%
Array(2044811, 600, 1, 0), //拳甲攻击卷轴65%
Array(2044812, 600, 1, 0), //指节攻击卷轴15%
Array(2044813, 600, 1, 0), //指节命中卷轴65%
Array(2044814, 600, 1, 0), //指节命中卷轴15%
Array(2044900, 600, 1, 0), //短枪攻击卷轴100%
Array(2044901, 600, 1, 0), //短枪攻击卷轴60%
Array(2044902, 600, 1, 0), //短枪攻击卷轴10%
Array(2044903, 600, 1, 0), //短枪攻击卷轴70%
Array(2044904, 600, 1, 0), //短枪攻击卷轴30%
Array(2044906, 600, 1, 0), //短枪攻击卷轴65%
Array(2044907, 600, 1, 0), //短枪攻击卷轴15%
Array(2049100, 100, 1, 1), //混沌卷轴60%
Array(1012011, 500, 1, 0), //圣诞鹿的鼻子
Array(1012012, 500, 1, 0), //圣诞鹿的鼻子
Array(1012013, 500, 1, 0), //圣诞鹿的鼻子
Array(1012014, 500, 1, 0), //圣诞鹿的鼻子
Array(1012015, 500, 1, 0), //圣诞鹿的鼻子
Array(1012016, 500, 1, 0), //圣诞鹿的鼻子
Array(1012017, 500, 1, 0), //圣诞鹿的鼻子
Array(1012018, 500, 1, 0), //圣诞鹿的鼻子
Array(1012019, 500, 1, 0), //圣诞鹿的鼻子
Array(1012020, 500, 1, 0), //圣诞鹿的鼻子
Array(1012056, 500, 1, 0), //狗狗鼻
Array(1012058, 500, 1, 0), //匹诺曹的鼻子
Array(1012059, 500, 1, 0), //匹诺曹的鼻子
Array(1012060, 500, 1, 0), //匹诺曹的鼻子
Array(1012061, 500, 1, 0), //匹诺曹的鼻子
Array(1032026, 100, 1, 0), //黄水晶耳环
Array(1032027, 100, 1, 0), //黑水晶耳环
Array(1032028, 100, 1, 0), //红水晶耳环
Array(1032030, 200, 1, 0), //勇气耳环
Array(1122058, 100, 1, 1), //休彼德蔓的混沌项链
Array(1132000, 800, 1, 1), //白色腰带
Array(1132001, 700, 1, 1), //黄色腰带
Array(1132002, 600, 1, 1), //蓝色腰带
Array(1132003, 500, 1, 1), //红色腰带
Array(1132004, 450, 1, 1), //黑贺腰带
Array(2290022, 100, 1, 0), //恶龙附身70%
Array(2290023, 100, 1, 0), //恶龙附身50%
Array(2290096, 100, 1, 0), //冒险岛勇士70%
Array(2290125, 100, 1, 0), //冒险岛勇士50%
Array(2290084, 100, 1, 0), //三连环光击破70%
Array(2290085, 100, 1, 0), //三连环光击破50%
Array(2290000, 500, 1, 0), //磁石70%
Array(2290001, 500, 1, 0), //磁石50%
Array(2290002, 500, 1, 0), //阿基斯基70%
Array(2290003, 500, 1, 0), //阿基斯基50%
Array(2290004, 500, 1, 0), //突进70%
Array(2290005, 500, 1, 0), //突进50%
Array(2290006, 500, 1, 0), //稳如泰山70%
Array(2290007, 500, 1, 0), //稳如泰山50%
Array(2290008, 500, 1, 0), //进阶斗气70%
Array(2290009, 500, 1, 0), //进阶斗气50%
Array(2290010, 200, 1, 0), //轻舞飞扬70%
Array(2290011, 200, 1, 0), //轻舞飞扬50%
Array(2290012, 500, 1, 0), //连环环破70%
Array(2290013, 500, 1, 0), //连环环破50%
Array(2290018, 500, 1, 0), //圣阴之剑70%
Array(2290019, 500, 1, 0), //圣阴之锤70%
Array(2290020, 500, 1, 0), //圣域70%
Array(2290021, 500, 1, 0), //圣域50%
Array(2290026, 300, 1, 0), //创世之破70%
Array(2290027, 300, 1, 0), //创世之破50%
Array(2290030, 300, 1, 0), //连环爆破70%
Array(2290031, 300, 1, 0), //连环爆破50%
Array(2290032, 300, 1, 0), //连环闪电70%
Array(2290033, 300, 1, 0), //连环闪电50%
Array(2290040, 300, 1, 0), //天降流行70%
Array(2290041, 300, 1, 0), //天降流行50%
Array(2290046, 300, 1, 0), //落霜冰破70%
Array(2290047, 300, 1, 0), //落霜冰破50%
Array(2290048, 300, 1, 0), //圣光普照70%
Array(2290049, 300, 1, 0), //圣光普照50%
Array(2290052, 300, 1, 0), //火焰晶晶70%
Array(2290053, 300, 1, 0), //火眼晶晶50%
Array(2290060, 300, 1, 0), //暴风剑雨70%
Array(2290061, 300, 1, 0), //暴风剑雨50%
Array(1002550, 500, 1, 0), //黑色格莱西头盔
Array(1002551, 500, 1, 0), //蓝龙头盔
Array(1002554, 500, 1, 0), //武艺头绳
//-----椅子-----
Array(2040416, 500, 1, 0), //上衣防御力卷轴15%
Array(3010013, 400, 1, 1), //悠长假期
Array(3010014, 400, 1, 1), //月亮弯
Array(3010018, 400, 1, 1), //椰子树沙滩椅
Array(3010019, 400, 1, 1), //寿司椅
Array(3010021, 400, 1, 1), //暖暖桌
Array(3010025, 400, 1, 1), //枫叶纪念凳
Array(3010028, 400, 1, 1), //海盗的俘虏
			Array(3010044,400,1,1), //红伞椅子
			Array(3010036,400,1,1), //秋千
			Array(3010049,400,1,1), //学房子
			Array(3010110,400,1,1), //熊
			Array(3010131,400,1,1), //熊猫
			Array(1022129,400,1,1), //眼睛
			Array(3012001,400,1,1), //篝火 
			Array(3012002,400,1,1), //浴桶
			Array(3012003,400,1,1), //爱心
			Array(3010013,400,1,1), //遮阳椅
			Array(3010018,400,1,1), //椰子树
			Array(3010021,400,1,1), //暖暖桌
			Array(3010024,400,1,1), //玩具熊
			Array(3010025,400,1,1), //5周年枫叶纪念
			Array(3010026,400,1,1), //恶灵附身
			Array(3010034,400,1,1), //假期红
			Array(3010035,400,1,1), //假期蓝
			Array(3010043,400,1,1), //魔女扫把
			Array(3010051,400,1,1), //沙漠兔兔1
			Array(3010052,400,1,1), //沙漠兔兔2
			Array(3010054,400,1,1), //呼噜床
			Array(3010057,400,1,1), //血色玫瑰
			Array(3010058,400,1,1), //世界末日
			Array(3010063,400,1,1), //月亮星星
			Array(3010068,400,1,1), //露水椅子
			Array(3010069,400,1,1), //大黄蜂
			Array(3010071,400,1,1), //神兽椅子
			Array(3010075,400,1,1), //音乐狂
			Array(3010075,400,1,1), //大熊猫
			Array(3010079,400,1,1), //肥猫
			Array(3010085,400,1,1), //鬼娃娃椅子
			Array(3010096,400,1,1), //恐龙化石
			Array(3010099,400,1,1), //北极熊椅子
			Array(3010109,400,1,1), //暖炉椅子
			Array(3010110,400,1,1), //白熊
			Array(3010129,400,1,1), //酋长宝座
			Array(3010139,400,1,1), //私密空间
			Array(3010140,400,1,1), //早日康复
			Array(3010147,400,1,1), //龙蛋椅子
			Array(3010149,400,1,1), //风扇
			Array(3010151,400,1,1), //无人岛
			Array(3010151,400,1,1), //三角张峰
			Array(3010169,400,1,1), //求领养
			Array(3010172,400,1,1), //星空椅子
			Array(3010175,400,1,1), //名画家椅子
			Array(3010193,400,1,1), //炼金瓶
			Array(3010195,400,1,1), //无价之宝
			Array(3010195,400,1,1), //泡泡浴缸
			Array(3010289,400,1,1), //老奶奶读通话
			Array(3010293,400,1,1), //恶灵椅子
			Array(3010403,400,1,1), //音乐会
			Array(3010410,400,1,1), //珍妮
			Array(3010411,400,1,1), //双鱼
			Array(3010412,400,1,1), //双塔
			Array(3010428,400,1,1), //水晶
			Array(3010437,400,1,1), //魔法书
			Array(3010438,400,1,1), //音符
			Array(3010453,400,1,1), //兔子
			Array(3010454,400,1,1), //爱心云朵
			Array(3010462,400,1,1), //天文台
			Array(3010494,400,1,1), //TV椅子
			Array(3010505,400,1,1), //看球赛
			Array(3010515,400,1,1), //奇石椅子
			Array(3010609,400,1,1), //不是在做梦
			Array(3010622,400,1,1), //丹真
			Array(3010632,400,1,1), //印第安
			Array(3010633,400,1,1), //印第安
			Array(3010659,400,1,1), //巴士
			Array(3010716,400,1,1), //超级蘑菇
			Array(3010729,400,1,1), //孤独男子
			Array(3010730,400,1,1), //小企鹅合唱团
			Array(3010733,400,1,1), //电视椅子
			Array(3010738,400,1,1), //闪电三人组
			Array(3010739,400,1,1), //雪人香波
			Array(3010753,400,1,1), //玫瑰鸟笼
			Array(3010767,400,1,1), //雪人椅子
			Array(3010760,400,1,1), //古代浴池
			Array(3010879,400,1,1), //繁星
			Array(3010937,400,1,1), //异界
			Array(3010938,400,1,1), //异界
			Array(3010939,400,1,1), //异界
			Array(3010946,400,1,1), //森林伙伴
			Array(3012007,400,1,1), //石狮
			Array(3012008,400,1,1), //稻荷神社
			Array(3012011,400,1,1), //火锅
			Array(3012022,400,1,1), //寿司
			Array(3015053,400,1,1), //三重杨
			Array(3015120,400,1,1), //枕头大战
			Array(3015264,400,1,1), //美味厨房
			Array(3015158,400,1,1), //印第安
			Array(3015158,400,1,1), //印第安
			Array(3015158,400,1,1), //印第安
Array(3010029, 450, 1, 1), //蓝环凳
Array(3010030, 450, 1, 1), //黑环凳
Array(3010031, 450, 1, 1), //红环凳
Array(3010032, 450, 1, 1), //黄环凳
Array(3010033, 450, 1, 1), //绿环凳
Array(3010037, 450, 1, 1), //猪猪凳
Array(3010044, 450, 1, 1), //同一红伞下
Array(3012001, 450, 1, 1), //篝火
Array(3012002, 450, 1, 1), //浴桶
Array(3010073, 450, 1, 1), //PB克缤
Array(3012003, 450, 1, 1), //爱心椅子
Array(3010012, 450, 1, 1), //剑士 宝座
Array(3010025, 450, 1, 1), //枫叶纪念凳
Array(3010037, 450, 1, 1), //猪猪凳
Array(3010038, 450, 1, 1), //爱心椅子
Array(3010040, 450, 1, 1), //蝙蝠椅
Array(3010041, 450, 1, 1), //骷髅王座
Array(3010043, 450, 1, 1), //魔女的飞扫把
Array(3010044, 450, 1, 1), //同一红伞下
Array(3010045, 450, 1, 1), //寒冰椅子
Array(3010046, 450, 1, 1), //红龙椅
Array(3010047, 400, 1, 1), //蓝龙椅
Array(3010048, 400, 1, 1), //圣诞树椅子
Array(3010049, 400, 1, 1), //雪房子
Array(3010050, 400, 1, 1), //公主凳
Array(3010057, 400, 1, 1), //血色玫瑰
Array(3010058, 400, 1, 1), //世界末日
Array(3010068, 400, 1, 1), //露水椅子
Array(3010071, 425, 1, 1), //神兽椅
Array(3010077, 425, 1, 1), //猫头鹰椅子
Array(3010085, 425, 1, 1), //鬼娃娃椅子
Array(3010096, 425, 1, 1), //恐龙化石宝座
Array(3010095, 425, 1, 1), //石头人座椅
Array(3010094, 415, 1, 1), //漂漂猪椅子
Array(3010098, 425, 1, 1), //电视宅人
Array(3010106, 425, 1, 1), //雪狼战椅
Array(3010112, 425, 1, 1)
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4001129,5)) {
            cm.sendYesNo("冒险岛转蛋机中有极品#b装备、卷轴技能书或稀有新奇的道具#k噢！使用“#b#t4001129##k”就可以交换. 游戏中的“GM”－“GM”区里有噢。 假如不买纪念币的话，是不可以使用我的。现在要玩转蛋机么? ");
        } else {
            cm.sendOk("你背包里有#b#t4001129##kX5吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 700);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "纪念币抽奖", notice);
            if (item != -1) {
                cm.gainItem(4001129, -5);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t4001129##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：白雪人法老的蓝宝石。)");
            cm.gainItem(4001129, -5);
            cm.gainItem(4001322, 1);
            cm.safeDispose();
        }
    }
}