status = -1;
var itemList = Array(
//-------耳环-------

Array(1082234, 300, 1, 1), //永恒定边手套
Array(1082235, 300, 1, 1), //永恒逍遥手套
Array(1082236, 300, 1, 1), //永恒白云手套
Array(1082237, 300, 1, 1), //永恒探云手套
Array(1082238, 300, 1, 1), //永恒抚浪手套
Array(1082239, 300, 1, 1), //重生定边手套
Array(1082240, 300, 1, 1), //重生逍遥手套
Array(1082241, 300, 1, 1), //重生白云手套
Array(1082242, 300, 1, 1), //重生探云手套
Array(1082243, 300, 1, 1), //重生抚浪手套
Array(1372044, 100, 1, 1), //永恒蝶翼杖
Array(1372045, 100, 1, 1), //重生蝶翼杖
Array(1382045, 100, 1, 1), //火灵珠长杖
Array(1382046, 100, 1, 1), //毒灵珠长杖
Array(1382047, 100, 1, 1), //冰灵珠长杖
Array(1382048, 100, 1, 1), //雷灵珠长杖
Array(1382049, 100, 1, 1), //朱雀长杖
Array(1382050, 100, 1, 1), //玄武长杖
Array(1382051, 100, 1, 1), //白虎长杖
Array(1382052, 100, 1, 1), //青龙长杖
Array(1382057, 100, 1, 1), //永恒冰轮杖
Array(1382059, 100, 1, 1), //重生冰轮杖
Array(1402013, 600, 1, 1), //白日剑
Array(1402014, 300, 1, 1), //温度计
Array(1032004, 500, 1, 0), //金耳环
Array(1032005, 500, 1, 0), //红十字耳环
Array(1032006, 500, 1, 0), //雷电耳环
Array(1032007, 500, 1, 0), //祖母綠耳环
Array(1032008, 500, 1, 0), //猫眼耳环
Array(1032009, 500, 1, 0), //黄方耳环
Array(1032012, 500, 1, 0), //骷髅耳环
Array(1032017, 500, 1, 0), //玫瑰耳环
Array(1032018, 500, 1, 0), //紫荆花耳环
Array(1032019, 500, 1, 0), //水仙耳环
Array(1032022, 500, 1, 0), //赤色圆型耳环
Array(1032023, 500, 1, 0), //草莓耳环
Array(1032025, 500, 1, 0), //叶子耳环
Array(1032026, 500, 1, 0), //黄水晶耳环
Array(1032027, 500, 1, 0), //黑水晶耳环
Array(1032028, 500, 1, 0), //红水晶耳环
Array(1032035, 500, 1, 1), //枫叶耳环
Array(1032040, 500, 1, 1), //枫叶型耳环
Array(1032041, 500, 1, 1), //枫叶型耳环
Array(1032042, 500, 1, 1), //枫叶型耳环
Array(1032047, 500, 1, 1), //可乐耳环
Array(1032055, 500, 1, 1), //工作人员C的旧收信机
Array(1032056, 500, 1, 1), //工作人员C的旧收信机
Array(1032057, 500, 1, 1), //工作人员C的旧收信机
Array(1032058, 500, 1, 1), //工作人员C钛质收信机
Array(1012070, 200, 1, 1), //工作人员C钛质收信机
Array(1012071, 200, 1, 1), //工作人员C钛质收信机
Array(1012072, 200, 1, 1), //工作人员C钛质收信机
Array(1012073, 200, 1, 1), //工作人员C钛质收信机
//-------帽子-------
Array(1002019, 500, 1, 0), //白头巾
Array(1002020, 500, 1, 0), //红星头巾
Array(1002021, 500, 1, 0), //诺曼头盔
Array(1002022, 500, 1, 0), //旧诺曼头盔
Array(1002023, 500, 1, 0), //枪骑士头盔
Array(1002024, 500, 1, 0), //祖母綠武士头盔
Array(1002030, 500, 1, 0), //银制战帽
Array(1002033, 500, 1, 0), //狗皮帽
Array(1002039, 500, 1, 0), //青铜头盔
Array(1002040, 500, 1, 0), //锂矿帽
Array(1002041, 500, 1, 0), //黄色金属头箍
Array(1002051, 500, 1, 0), //青铜头盔
Array(1002052, 500, 1, 0), //锂矿头盔
Array(1002053, 500, 1, 0), //绿色皮帽
Array(1002054, 500, 1, 0), //红色皮帽
Array(1002055, 500, 1, 0), //青铜橄榄球帽
Array(1002056, 500, 1, 0), //锂矿橄榄球帽
Array(1002057, 500, 1, 0), //绿色高级皮帽
Array(1002058, 500, 1, 0), //锂矿海王头盔
Array(1002059, 500, 1, 0), //青铜海王头盔
Array(1002060, 500, 1, 0), //黑色棒球帽
Array(1002061, 500, 1, 0), //黄色棒球帽
Array(1402037, 150, 1, 1), //龙背刃
Array(1402044, 300, 1, 0), //南瓜灯笼
Array(1402046, 300, 1, 1), //永恒玄冥剑
Array(1402047, 300, 1, 1), //重生玄冥剑
Array(1412033, 100, 1, 1), //永恒碎鼋斧
Array(1412034, 100, 1, 1), //重生碎鼋斧
Array(1432047, 100, 1, 1), //永恒显圣枪
Array(1432048, 700, 1, 0), //铲子
Array(1432049, 100, 1, 1), //重生显圣枪
Array(1452057, 100, 1, 1), //永恒惊电弓
Array(1452059, 100, 1, 1), //重生惊电弓
Array(1462050, 100, 1, 1), //永恒冥雷弩
Array(1462051, 100, 1, 1), //重生冥雷弩
Array(1472051, 600, 1, 1), //寒木升龙拳
Array(1472052, 600, 1, 1), //碧水落龙拳
Array(1472053, 600, 1, 1), //逆龙咆哮拳
Array(1132152,200,1,1),//外星人腰带
Array(1122197,200,1,1),//外星人吊坠
Array(1032142,200,1,1),//外星人耳环
Array(1082432,200,1,1),//外星人手套
Array(1052460,200,1,1),//外星人之套装
Array(1052998,200,1,1),//外星人连身服
Array(1092110,200,1,1),//外星人之盾(法师)
Array(1092111,200,1,1),//外星人之盾(飞侠)
Array(1092109,200,1,1),//外星人之盾(战士)
Array(1302224,200,1,1),//外星人之单手剑
//Array(1532113,200,1,1),//外星人之手炮
Array(1442181,200,1,1),//外星人之矛
Array(1362104,200,1,1),//外星人之手杖
Array(1452168,200,1,1),//外星人之弓
//Array(1242086,200,1,1),//外星人之能量剑
Array(1432137,200,1,1),//外星人之枪
Array(1492149,200,1,1),//外星人之短枪
Array(1322161,200,1,1),//外星人之单手钝器
Array(1372137,200,1,1),//外星人之短杖
//Array(1212084,200,1,1),//外星人之双头杖
//Array(1222079,200,1,1),//外星人之灵魂手铳
Array(1462157,100,1,1),//外星人之弩
Array(1382167,100,1,1),//外星人之长杖
Array(1422106,100,1,1),//外星人之双手钝器
Array(1402150,100,1,1),//外星人之双手剑
Array(1482139,100,1,1),//外星人之指节
Array(1472178,100,1,1),//外星人之拳套
Array(1003540,100,1,1),//外星人之头盔
Array(1102205,200,1,1),//绯红之心披风
Array(1152135,200,1,1),//绯红肩章
Array(1142619,500,1,1),//绯红的救星
Array(1142659,500,1,1),//绯红守护者
Array(1452060,200,1,1),//绯红之弓
Array(1442068,200,1,1),//绯红弯刃
Array(1382060,120,1,1),//绯红法杖
Array(3010075,400,1,1), //音乐狂
			Array(3010075,400,1,1), //大熊猫
			Array(3010079,400,1,1), //肥猫
			Array(3010085,400,1,1), //鬼娃娃椅子
			Array(3010096,400,1,1), //恐龙化石
			Array(3010099,400,1,1), //北极熊椅子
			Array(3010109,400,1,1), //暖炉椅子
			Array(3010110,400,1,1), //白熊
			Array(3010129,400,1,1), //酋长宝座
			Array(3010139,400,1,1), //私密空间
			Array(3010140,400,1,1), //早日康复
			Array(3010147,400,1,1), //龙蛋椅子
			Array(3010149,400,1,1), //风扇
			Array(3010151,400,1,1), //无人岛
			Array(3010151,400,1,1), //三角张峰
			Array(3010169,400,1,1), //求领养
			Array(3010172,400,1,1), //星空椅子
			Array(3010175,400,1,1), //名画家椅子
			Array(3010193,400,1,1), //炼金瓶
			Array(3010195,400,1,1), //无价之宝
			Array(3010195,400,1,1), //泡泡浴缸
			Array(3010289,400,1,1), //老奶奶读通话
			Array(3010293,400,1,1), //恶灵椅子
			Array(3010403,400,1,1), //音乐会
			Array(3010410,400,1,1), //珍妮
			Array(3010411,400,1,1), //双鱼
			Array(3010412,400,1,1), //双塔
			Array(3010428,400,1,1), //水晶
			Array(3010437,400,1,1), //魔法书
			Array(3010438,400,1,1), //音符
			Array(3010453,400,1,1), //兔子
			Array(3010454,400,1,1), //爱心云朵
			Array(3010462,400,1,1), //天文台
			Array(3010494,400,1,1), //TV椅子
			Array(3010505,400,1,1), //看球赛
			Array(3010515,400,1,1), //奇石椅子
			Array(3010609,400,1,1), //不是在做梦
			Array(3010622,400,1,1), //丹真
			Array(3010632,400,1,1), //印第安
			Array(3010633,400,1,1), //印第安
			Array(3010659,400,1,1), //巴士
			Array(3010716,400,1,1), //超级蘑菇
			Array(3010729,400,1,1), //孤独男子
			Array(3010730,400,1,1), //小企鹅合唱团
			Array(3010733,400,1,1), //电视椅子
			Array(3010738,400,1,1), //闪电三人组
			Array(3010739,400,1,1), //雪人香波
			Array(3010753,400,1,1), //玫瑰鸟笼
			Array(3010767,400,1,1), //雪人椅子
			Array(3010760,400,1,1), //古代浴池
			Array(3010879,400,1,1), //繁星
			Array(3010937,400,1,1), //异界
			Array(3010938,400,1,1), //异界
			Array(3010939,400,1,1), //异界
			Array(3010946,400,1,1), //森林伙伴
			Array(3012007,400,1,1), //石狮
			Array(3012008,400,1,1), //稻荷神社
			Array(3012011,400,1,1), //火锅
			Array(3012022,400,1,1), //寿司
			Array(3015053,400,1,1), //三重杨
			Array(3015120,400,1,1), //枕头大战
			Array(3015264,400,1,1), //美味厨房
			Array(3015158,400,1,1), //印第安
			Array(3015158,400,1,1), //印第安
			Array(3015158,400,1,1), //印第安
Array(2040000, 500, 1, 0), //头盔防御卷轴 成功率100%
Array(2040001, 500, 1, 0), //头盔防御卷轴60%
Array(2040002, 500, 1, 0), //头盔防御卷轴10%
Array(2040003, 500, 1, 0), //头盔体力卷轴100%
Array(2040004, 500, 1, 0), //头盔体力卷轴60%
Array(2040005, 500, 1, 0), //头盔体力卷轴10%
Array(2040008, 500, 1, 0), //头盔防御诅咒卷轴70%
Array(2040009, 500, 1, 0), //头盔防御诅咒卷轴30%
Array(2040010, 500, 1, 0), //头盔体力诅咒卷轴70%
Array(2040011, 500, 1, 0), //头盔体力诅咒卷轴30%
Array(2040012, 500, 1, 1), //头盔智力卷轴70%
Array(2040013, 500, 1, 1), //头盔智力卷轴30%
Array(2040014, 500, 1, 0), //头盔命中率诅咒卷轴70%
Array(2040015, 500, 1, 0), //头盔命中率诅咒卷轴30%
Array(2040016, 500, 1, 0), //头盔命中率卷轴10%
Array(2040017, 500, 1, 0), //头盔命中率卷轴60%
Array(2040018, 500, 1, 0), //头盔命中率卷轴100%
Array(2040019, 500, 1, 0), //头盔防御卷轴65%
Array(2040020, 500, 1, 0), //头盔防御卷轴15%
Array(2040021, 500, 1, 0), //头盔体力卷轴65%
Array(2040022, 500, 1, 0), //头盔体力卷轴15%
Array(2040024, 500, 1, 0), //头盔智力卷轴100%
Array(2040025, 500, 1, 0), //头盔智力卷轴60%
Array(2040026, 500, 1, 1), //头盔智力卷轴10%
Array(2040027, 500, 1, 0), //头盔敏捷卷轴100%
Array(2040028, 500, 1, 0), //头盔敏捷卷轴70%
Array(2040029, 500, 1, 0), //头盔敏捷卷轴60%
Array(2040030, 500, 1, 0), //头盔敏捷卷轴30%
Array(2040031, 500, 1, 1), //头盔敏捷卷轴10%
Array(2040100, 500, 1, 0), //脸部装饰生命卷轴10%
Array(2040101, 500, 1, 0), //脸部装饰生命卷轴60%
Array(2040103, 500, 1, 0), //脸部装饰生命诅咒卷轴30%
Array(2040104, 500, 1, 0), //脸部装饰生命诅咒卷轴70%
Array(2040105, 500, 1, 1), //脸部装饰回避率卷轴10%
Array(2040106, 500, 1, 0), //脸部装饰回避率卷轴60%
Array(2040108, 500, 1, 0), //脸部装饰回避率诅咒卷轴30%
Array(2040109, 500, 1, 0), //脸部装饰回避率诅咒卷轴70%
Array(2040200, 200, 1, 1), //眼部装饰命中率卷轴10%
Array(2040201, 200, 1, 1), //眼部装饰命中率卷轴60%
Array(2040203, 200, 1, 1), //眼部装饰命中率诅咒卷轴30%
Array(2040204, 200, 1, 1), //眼部装饰命中率诅咒卷轴70%
Array(2040205, 200, 1, 1), //眼部装饰智力卷轴10%
Array(2040206, 200, 1, 1), //眼部装饰智力卷轴60%
Array(2040208, 200, 1, 1), //眼部装饰智力诅咒卷轴30%
Array(2040209, 200, 1, 1), //眼部装饰智力诅咒卷轴70%
Array(2040300, 100, 1, 0), //耳环智力卷轴100%
Array(2040301, 100, 1, 0), //耳环智力卷轴60%
Array(2040302, 150, 1, 1), //耳环智力卷轴10%
Array(2040304, 100, 1, 0), //耳环智力诅咒卷轴70%
Array(2040305, 100, 1, 0), //耳环智力诅咒卷轴30%
Array(2040306, 200, 1, 0), //耳环敏捷卷轴70%
Array(2040307, 200, 1, 0), //耳环敏捷卷轴30%
Array(2040308, 500, 1, 0), //耳环防御力诅咒卷轴70%
Array(2040309, 500, 1, 0), //耳环防御力诅咒卷轴30%
Array(2040310, 500, 1, 0), //耳环防御力卷轴10%
Array(2040311, 500, 1, 0), //耳环防御力卷轴60%
Array(2040312, 500, 1, 0), //耳环防御力卷轴100%
Array(2040313, 100, 1, 1), //耳环智力卷轴65%
Array(2040314, 200, 1, 1), //耳环智力卷轴15%
Array(2040316, 100, 1, 0), //耳环敏捷卷轴100%
Array(2040317, 100, 1, 0), //耳环敏捷卷轴60%
Array(2040318, 200, 1, 1), //耳环敏捷卷轴10%
Array(2040319, 200, 1, 0), //耳环装饰运气卷轴100%
Array(2040320, 200, 1, 0), //耳环运气卷轴70%
Array(2040321, 200, 1, 0), //耳环装饰运气卷轴60%
Array(2040322, 200, 1, 0), //耳环装饰运气卷轴30%
Array(2040323, 100, 1, 1), //耳环运气卷轴10%
Array(2040324, 500, 1, 0), //耳环装饰体力卷轴100%
Array(2040325, 600, 1, 0), //耳环装饰体力卷轴70%
Array(2040326, 100, 1, 0), //耳环装饰体力卷轴60%
Array(2040327, 100, 1, 0), //耳环装饰体力卷轴30%
Array(2040328, 100, 1, 0), //耳环装饰体力卷轴10%
Array(2040400, 500, 1, 0), //上衣防御卷轴100%
Array(2040401, 500, 1, 0), //上衣防御卷轴60%
Array(2040402, 500, 1, 0), //上衣防御卷轴10%
Array(2040404, 500, 1, 0), //上衣防御诅咒卷轴70%
Array(2040405, 500, 1, 0), //上衣防御诅咒卷轴30%
Array(2040406, 500, 1, 0), //上衣力量卷轴70%
Array(2040407, 500, 1, 0), //上衣力量卷轴30%
Array(2040408, 500, 1, 0), //上衣体力卷轴70%
Array(2040409, 500, 1, 0), //上衣体力卷轴30%
Array(2040410, 600, 1, 0), //上衣运气诅咒卷轴70%
Array(2040411, 600, 1, 0), //上衣运气诅咒卷轴30%
Array(2040412, 600, 1, 0), //上衣运气卷轴10%
Array(2040413, 600, 1, 0), //上衣运气卷轴60%
Array(2040414, 500, 1, 0), //上衣运气卷轴100%
Array(2040415, 500, 1, 0), //上衣防御力卷轴65%
Array(2040416, 500, 1, 0), //上衣防御力卷轴15%
Array(2040417, 500, 1, 0), //上衣力量卷轴100%
Array(2040418, 500, 1, 0), //上衣力量卷轴60%
Array(2040419, 500, 1, 0), //上衣力量卷轴10%
Array(2040420, 500, 1, 0), //上衣体力卷轴100%
Array(2040421, 500, 1, 0), //上衣体力卷轴60%
Array(2040422, 500, 1, 0), //上衣体力卷轴10%
Array(2040423, 500, 1, 0), //上衣运气卷轴100%
Array(2040424, 500, 1, 0), //上衣运气卷轴70%
Array(2040425, 500, 1, 0), //上衣运气卷轴60%
Array(2040426, 500, 1, 0), //上衣运气卷轴30%
Array(2040427, 500, 1, 0), //上衣运气卷轴10%
Array(2040500, 500, 1, 0), //全身铠甲敏捷卷轴100%
Array(2040501, 200, 1, 0), //全身铠甲敏捷卷轴60%
Array(2040502, 100, 1, 1), //全身铠甲敏捷卷轴10%
Array(2040503, 600, 1, 0), //全身铠甲防御卷轴100%
Array(2040504, 100, 1, 0), //全身铠甲防御卷轴60%
Array(2040505, 200, 1, 0), //全身铠甲防御卷轴10%
Array(2040508, 600, 1, 0), //全身铠甲敏捷诅咒卷轴70%
Array(2040509, 600, 1, 0), //全身铠甲敏捷诅咒卷轴30%
Array(2040510, 600, 1, 0), //全身铠甲防御诅咒卷轴70%
Array(2040511, 600, 1, 0), //全身铠甲防御诅咒卷轴70%
Array(2040512, 600, 1, 0), //全身铠甲智力卷轴100%
Array(2040513, 600, 1, 0), //全身铠甲智力卷轴60%
Array(2040514, 200, 1, 0), //全身铠甲智力卷轴10%
Array(2040515, 400, 1, 1), //全身铠甲运气卷轴100%
Array(2040516, 400, 1, 0), //全身铠甲运气卷轴60%
Array(2040517, 600, 1, 0), //全身铠甲运气卷轴10%
Array(2040518, 400, 1, 0), //全身盔甲智力卷轴70%
Array(2040519, 400, 1, 0), //全身盔甲智力卷轴30%
Array(2040520, 400, 1, 0), //全身盔甲幸运卷轴70%
Array(2040521, 400, 1, 0), //全身盔甲幸运卷轴30%
Array(2040522, 400, 1, 0), //全身盔甲敏捷卷轴65%
Array(2040523, 600, 1, 0), //全身盔甲敏捷卷轴15%
Array(2040524, 400, 1, 0), //全身盔甲防御卷轴65%
Array(2040525, 400, 1, 0), //全身盔甲防御卷轴15%
Array(2040526, 600, 1, 0), //全身盔甲智力卷轴65%
Array(2040527, 400, 1, 0), //全身盔甲智力卷轴15%
Array(2040528, 600, 1, 0), //全身盔甲幸运卷轴65%
Array(2040529, 400, 1, 0), //全身盔甲幸运卷轴15%
Array(2040530, 500, 1, 0), //全身盔甲力量卷轴100%
Array(2040531, 400, 1, 0), //全身盔甲力量卷轴70%
Array(2040532, 400, 1, 0), //全身盔甲力量卷轴60%
Array(2040533, 400, 1, 0), //全身盔甲力量卷轴30%
Array(2040534, 600, 1, 1), //全身盔甲力量卷轴10%
Array(2040600, 500, 1, 0), //裤/裙防御卷轴100%
Array(2040601, 500, 1, 0), //裤/裙防御卷轴60%
Array(2040602, 500, 1, 0), //裤/裙防御卷轴10%
Array(2040604, 500, 1, 0), //裤/裙防御诅咒卷轴70%
Array(2040605, 500, 1, 0), //裤/裙防御诅咒卷轴30%
Array(2040606, 500, 1, 0), //裤裙跳跃诅咒卷轴70%
Array(2040607, 500, 1, 0), //裤裙跳跃诅咒卷轴30%
Array(2040608, 500, 1, 0), //裤裙体力诅咒卷轴70%
Array(2040609, 500, 1, 0), //裤裙体力诅咒卷轴30%
Array(2040610, 500, 1, 0), //裤裙敏捷诅咒卷轴70%
Array(2040611, 500, 1, 0), //裤裙敏捷诅咒卷轴30%
Array(2040612, 500, 1, 0), //裤裙敏捷卷轴10%
Array(2040613, 500, 1, 0), //裤裙敏捷卷轴60%
Array(2040614, 500, 1, 0), //裤裙敏捷卷轴100%
Array(2040615, 500, 1, 0), //裤裙防御卷轴65%
Array(2040616, 500, 1, 0), //裤裙防御卷轴15%
Array(2040617, 500, 1, 0), //裤裙跳跃卷轴100%
Array(2040618, 500, 1, 0), //裤裙跳跃卷轴60%
Array(2040619, 500, 1, 0), //裤裙跳跃卷轴10%
Array(2040620, 500, 1, 0), //裤裙体力卷轴100%
Array(2040621, 500, 1, 0), //裤裙体力卷轴60%
Array(2040622, 500, 1, 0), //裤裙体力卷轴10%
Array(2040623, 600, 1, 0), //裤裙敏捷卷轴100%
Array(2040624, 600, 1, 0), //裤裙敏捷卷轴70%
Array(2040625, 600, 1, 0), //裤裙敏捷卷轴60%
Array(2040626, 600, 1, 0), //裤裙敏捷卷轴30%
Array(2040627, 200, 1, 0), //裤裙敏捷卷轴10%
Array(2040700, 200, 1, 0), //鞋子敏捷度卷轴100%
Array(2040701, 600, 1, 0), //鞋子敏捷度卷轴60%
Array(2040702, 400, 1, 0), //鞋子敏捷度卷轴10%
Array(2040703, 200, 1, 0), //鞋子跳跃卷轴100%
Array(2040704, 600, 1, 0), //鞋子跳跃卷轴60%
Array(2040705, 400, 1, 0), //鞋子跳跃卷轴10%
Array(2040706, 500, 1, 0), //鞋子速度卷轴100%
Array(2040707, 500, 1, 0), //鞋子速度卷轴60%
Array(2040708, 500, 1, 0), //鞋子速度卷轴10%
Array(2040712, 500, 1, 0), //鞋子敏捷诅咒卷轴70%
Array(2040713, 500, 1, 0), //鞋子敏捷诅咒卷轴30%
Array(2040714, 500, 1, 0), //鞋子跳跃诅咒卷轴70%
Array(2040715, 500, 1, 0), //鞋子跳跃诅咒卷轴30%
Array(2040716, 500, 1, 0), //鞋子速度诅咒卷轴70%
Array(2040717, 500, 1, 0), //鞋子速度诅咒卷轴30%
Array(2040718, 600, 1, 0), //鞋子敏捷卷轴65%
Array(2040719, 400, 1, 0), //鞋子敏捷卷轴15%
Array(2040720, 600, 1, 0), //鞋子跳跃卷轴65%
Array(2040721, 600, 1, 0), //鞋子跳跃卷轴15%
Array(2040722, 500, 1, 0), //鞋子速度卷轴65%
Array(2040723, 500, 1, 0), //鞋子速度卷轴15%
Array(2040727, 500, 1, 0), //鞋子防滑卷轴10%
Array(2040800, 600, 1, 1), //手套敏捷卷轴100%
Array(2040801, 400, 1, 1), //手套敏捷卷轴60%
Array(2040802, 600, 1, 1), //手套敏捷卷轴10%
Array(2040803, 100, 1, 1), //手套攻击卷轴100%
Array(2040804, 400, 1, 1), //手套攻击卷轴60%
Array(2040805, 200, 1, 1), //手套攻击卷轴10%
Array(2040808, 500, 1, 0), //手套敏捷诅咒卷轴70%
Array(2040809, 500, 1, 0), //手套敏捷诅咒卷轴30%
Array(2040810, 100, 1, 1), //手套攻击诅咒卷轴70%
Array(2040811, 100, 1, 1), //手套攻击诅咒卷轴30%
Array(2040812, 500, 1, 0), //手套体力卷轴70%
Array(2040813, 500, 1, 0), //手套体力卷轴30%
Array(2040814, 500, 1, 0), //手套魔力诅咒卷轴70%
Array(2040815, 500, 1, 0), //手套魔力诅咒卷轴30%
Array(2040816, 500, 1, 0), //手套魔力卷轴10%
Array(2040817, 500, 1, 0), //手套魔力卷轴60%
Array(2040818, 500, 1, 0), //手套魔力卷轴100%
Array(2040819, 500, 1, 0), //手套敏捷卷轴65%
Array(2040820, 500, 1, 0), //手套敏捷卷轴15%
Array(2040821, 600, 1, 1), //手套攻击卷轴65%
Array(2040822, 600, 1, 1), //手套攻击卷轴15%
Array(2040823, 200, 1, 0), //手套体力卷轴100%
Array(2040824, 500, 1, 0), //手套体力卷轴60%
Array(2040825, 500, 1, 0), //手套体力卷轴10%
Array(2040900, 500, 1, 0), //盾牌防御卷轴
Array(2040901, 500, 1, 0), //盾牌防御卷轴60%
Array(2040902, 500, 1, 0), //盾牌防御卷轴10%
Array(2040904, 500, 1, 0), //盾牌防御诅咒卷轴70%
Array(2040905, 500, 1, 0), //盾牌防御诅咒卷轴30%
Array(2040906, 500, 1, 0), //盾牌运气卷轴70%
Array(2040907, 500, 1, 0), //盾牌运气卷轴30%
Array(2040908, 500, 1, 0), //盾牌体力卷轴70%
Array(2040909, 500, 1, 0), //盾牌体力卷轴30%
Array(2040910, 500, 1, 0), //盾牌防御卷轴65%
Array(2040911, 500, 1, 0), //盾牌防御卷轴15%
Array(2040914, 600, 1, 0), //盾牌攻击卷轴60%
Array(2040915, 600, 1, 0), //盾牌攻击卷轴10%
Array(2040916, 400, 1, 0), //盾牌攻击诅咒卷轴70%
Array(2040917, 200, 1, 0), //盾牌攻击诅咒卷轴30%
Array(2040919, 200, 1, 0), //盾牌魔力卷轴60%
Array(2040920, 600, 1, 0), //盾牌魔力卷轴10%
Array(2040921, 600, 1, 0), //盾牌魔力诅咒卷轴70%
Array(2040922, 400, 1, 0), //盾牌魔力诅咒卷轴30%
Array(2040923, 200, 1, 0), //盾牌运气卷轴100%
Array(2040924, 600, 1, 0), //盾牌运气卷轴60%
Array(2040925, 400, 1, 0), //盾牌运气卷轴10%
Array(2040926, 800, 1, 0), //盾牌体力卷轴100%
Array(2040927, 800, 1, 0), //盾牌体力卷轴60%
Array(2040928, 800, 1, 0), //盾牌体力卷轴10%
Array(2040929, 400, 1, 0), //盾牌力量卷轴100%
Array(2040930, 600, 1, 0), //盾牌力量卷轴70%
Array(2040931, 200, 1, 0), //盾牌力量卷轴60%
Array(2040932, 100, 1, 0), //盾牌力量卷轴30%
Array(2040933, 600, 1, 0), //盾牌力量卷轴10%
Array(2041000, 600, 1, 0), //披风魔防卷轴100%
Array(2041001, 600, 1, 0), //披风魔防卷轴60%
Array(2041002, 600, 1, 0), //披风魔防卷轴10%
Array(2041003, 600, 1, 0), //披风防御卷轴100%
Array(2041004, 600, 1, 0), //披风防御卷轴60%
Array(2041005, 600, 1, 0), //披风防御卷轴10%
Array(2041006, 600, 1, 0), //披风体力卷轴100%
Array(2041007, 600, 1, 0), //披风体力卷轴60%
Array(2041008, 600, 1, 0), //披风体力卷轴10%
Array(2041009, 600, 1, 0), //披风魔力卷轴100%
Array(2041010, 600, 1, 0), //披风魔力卷轴60%
Array(2041011, 600, 1, 0), //披风魔力卷轴10%
Array(2041012, 600, 1, 0), //披风力量卷轴100%
Array(2041013, 600, 1, 0), //披风力量卷轴60%
Array(2041014, 600, 1, 0), //披风力量卷轴10%
Array(2041015, 340, 1, 0), //披风智力卷轴100%
Array(2041016, 600, 1, 0), //披风智力卷轴60%
Array(2041017, 600, 1, 0), //披风智力卷轴10%
Array(2041018, 600, 1, 0), //披风敏捷卷轴100%
Array(2041019, 600, 1, 0), //披风敏捷卷轴60%
Array(2041020, 600, 1, 0), //披风敏捷卷轴10%
Array(2041021, 600, 1, 0), //披风运气卷轴100%
Array(2041022, 600, 1, 0), //披风运气卷轴60%
Array(2041023, 600, 1, 0), //披风运气卷轴10%
Array(2041026, 600, 1, 0), //披风魔防诅咒卷轴70%
Array(2041027, 600, 1, 0), //披风魔防诅咒卷轴30%
Array(2041028, 600, 1, 0), //披风防御诅咒卷轴70%
Array(2041029, 600, 1, 0), //披风防御诅咒卷轴30%
Array(2041030, 600, 1, 0), //披风体力诅咒卷轴70%
Array(2041031, 600, 1, 0), //披风体力诅咒卷轴30%
Array(2041032, 600, 1, 0), //披风魔力诅咒卷轴70%
Array(2041033, 600, 1, 0), //披风魔力诅咒卷轴30%
Array(2041034, 600, 1, 0), //披风力量诅咒卷轴70%
Array(2041035, 600, 1, 0), //披风力量诅咒卷轴30%
Array(2041036, 600, 1, 0), //披风智力诅咒卷轴70%
Array(2041037, 600, 1, 0), //披风智力诅咒卷轴30%
Array(2041038, 600, 1, 0), //披风敏捷诅咒卷轴70%
Array(2041039, 600, 1, 0), //披风敏捷诅咒卷轴30%
Array(2041040, 600, 1, 0), //披风运气诅咒卷轴70%
Array(2041041, 600, 1, 0), //披风运气诅咒卷轴30%
Array(2041042, 600, 1, 0), //披风魔法防御卷轴65%
Array(2041043, 600, 1, 0), //披风魔法防御卷轴15%
Array(2041044, 600, 1, 0), //披风物理防御卷轴65%
Array(2041045, 600, 1, 0), //披风物理防御卷轴15%
Array(2041046, 600, 1, 0), //披风体力卷轴65%
Array(2041047, 600, 1, 0), //披风体力卷轴15%
Array(2041048, 600, 1, 0), //披风魔力卷轴65%
Array(2041049, 600, 1, 0), //披风魔力卷轴15%
Array(2041050, 600, 1, 0), //披风力卷轴65%
Array(2041051, 600, 1, 0), //披风力卷轴15%
Array(2041052, 600, 1, 0), //披风智力卷轴65%
Array(2041053, 600, 1, 0), //披风智力卷轴15%
Array(2041054, 600, 1, 0), //披风敏捷卷轴65%
Array(2041055, 600, 1, 0), //披风敏捷卷轴15%
Array(2041056, 600, 1, 0), //披风幸运卷轴65%
Array(2041057, 600, 1, 1), //披风幸运卷轴15%
Array(2041058, 600, 1, 1), //披风防寒卷轴10%
Array(2041201, 600, 1, 1), //项链运气卷轴10%
Array(2041202, 600, 1, 1), //项链运气卷轴60%
Array(2041203, 600, 1, 1), //项链运气卷轴100%
Array(2041204, 600, 1, 1), //项链运气诅咒卷轴30%
Array(2041205, 600, 1, 1), //项链运气诅咒卷轴70%
Array(2041206, 600, 1, 1), //项链力量卷轴10%
Array(2041207, 600, 1, 1), //项链力量卷轴60%
Array(2041208, 600, 1, 1), //项链力量卷轴100%
Array(2041209, 600, 1, 1), //项链力量诅咒卷轴30%
Array(2041210, 600, 1, 1), //项链力量诅咒卷轴70%
Array(2041301, 600, 1, 0), //腰带力量卷轴60%
Array(2041304, 600, 1, 0), //腰带智力卷轴60%
Array(2041307, 600, 1, 0), //腰带敏捷卷轴60%
Array(2041310, 600, 1, 0), //腰带运气卷轴60%
Array(2043000, 600, 1, 0), //单手剑攻击卷轴100%
Array(2043001, 600, 1, 0), //单手剑攻击卷轴60%
Array(2043002, 600, 1, 0), //单手剑攻击卷轴10%
Array(2043004, 600, 1, 0), //单手剑攻击诅咒卷轴70%
Array(2043005, 600, 1, 0), //单手剑攻击诅咒卷轴30%
Array(2043006, 600, 1, 0), //单手剑魔力诅咒卷轴70%
Array(2043007, 600, 1, 0), //单手剑魔力诅咒卷轴30%
Array(2043008, 600, 1, 0), //单手剑魔力卷轴10%
Array(2043009, 600, 1, 0), //单手剑魔力卷轴60%
Array(2043010, 600, 1, 0), //单手剑魔力卷轴100%
Array(2043011, 600, 1, 0), //单手剑攻击卷轴65%
Array(2043012, 600, 1, 0), //单手剑攻击卷轴15%
Array(2043015, 600, 1, 0), //单手剑命中率卷轴100%
Array(2043016, 600, 1, 0), //单手剑命中率卷轴70%
Array(2043017, 600, 1, 0), //单手剑命中率卷轴60%
Array(2043018, 600, 1, 0), //单手剑命中率卷轴30%
Array(2043019, 600, 1, 0), //单手剑命中率卷轴10%
Array(2043024, 600, 1, 0), //单手剑命中卷轴65%
Array(2043025, 600, 1, 0), //单手剑命中卷轴15%
Array(2043100, 600, 1, 0), //单手斧攻击卷轴100%
Array(2043101, 600, 1, 0), //单手斧攻击卷轴60%
Array(2043102, 600, 1, 0), //单手斧攻击卷轴10%
Array(2043104, 400, 1, 0), //单手斧攻击诅咒卷轴70%
Array(2043105, 400, 1, 0), //单手斧攻击诅咒卷轴30%
Array(2043106, 400, 1, 0), //单手斧攻击卷轴65%
Array(2043107, 400, 1, 0), //单手斧攻击卷轴15%
Array(2043110, 400, 1, 0), //单手斧命中率卷轴100%
Array(2043111, 400, 1, 0), //单手斧命中率卷轴70%
Array(2043112, 400, 1, 0), //单手斧命中率卷轴60%
Array(2043113, 400, 1, 0), //单手斧命中率卷轴30%
Array(2043114, 400, 1, 0), //单手斧命中率卷轴10%
Array(2043118, 400, 1, 0), //单手斧命中卷轴65%
Array(2043119, 400, 1, 0), //单手斧命中卷轴15%
Array(2043200, 400, 1, 0), //单手钝器攻击卷轴100%
Array(2043201, 400, 1, 0), //单手钝器攻击卷轴60%
Array(2043202, 400, 1, 0), //单手钝器攻击卷轴10%
Array(2043204, 400, 1, 0), //单手钝器攻击诅咒卷轴70%
Array(2043205, 400, 1, 0), //单手钝器攻击诅咒卷轴30%
Array(2043206, 400, 1, 0), //单手钝器攻击卷轴65%
Array(2043207, 400, 1, 0), //单手钝器攻击卷轴15%
Array(2043210, 400, 1, 0), //单手钝器命中率卷轴100%
Array(2043211, 400, 1, 0), //单手钝器命中率卷轴70%
Array(2043212, 400, 1, 0), //单手钝器命中率卷轴60%
Array(2043213, 400, 1, 0), //单手钝器命中率卷轴30%
Array(2043214, 400, 1, 0), //单手钝器命中率卷轴10%
Array(2043218, 400, 1, 0), //单手钝器命中卷轴65%
Array(2043219, 400, 1, 0), //单手钝器命中卷轴15%
Array(2043300, 450, 1, 0), //短剑攻击卷轴100%
Array(2043301, 400, 1, 0), //短剑攻击卷轴60%
Array(2043302, 400, 1, 0), //短剑攻击卷轴10%
Array(2043304, 400, 1, 0), //短剑攻击诅咒卷轴70%
Array(2043305, 400, 1, 0), //短剑攻击诅咒卷轴30%
Array(2043306, 400, 1, 0), //短剑攻击卷轴65%
Array(2043307, 400, 1, 0), //短剑攻击卷轴15%
Array(2043700, 400, 1, 0), //短杖魔力卷轴100%
Array(2043701, 400, 1, 0), //短杖魔力卷轴60%
Array(2043702, 400, 1, 0), //短杖魔力卷轴10%
Array(2043704, 400, 1, 0), //短杖魔力诅咒卷轴70%
Array(2043705, 400, 1, 0), //短杖魔力诅咒卷轴30%
Array(2043706, 400, 1, 0), //短杖魔力卷轴65%
Array(2043707, 400, 1, 0), //短杖魔力卷轴15%
Array(2043800, 400, 1, 0), //长杖魔力卷轴100%
Array(2043801, 400, 1, 0), //长杖魔力卷轴60%
Array(2043802, 600, 1, 0), //长杖魔力卷轴10%
Array(2043804, 600, 1, 0), //长杖魔力诅咒卷轴70%
Array(2043805, 600, 1, 0), //长杖魔力诅咒卷轴30%
Array(2043806, 600, 1, 0), //长杖魔力卷轴65%
Array(2043807, 600, 1, 0), //长杖魔力卷轴15%
Array(2044000, 500, 1, 1), //双手剑攻击卷轴100%
Array(2044001, 600, 1, 1), //双手剑攻击卷轴60%
Array(2044002, 600, 1, 1), //双手剑攻击卷轴10%
Array(2044004, 400, 1, 1), //双手剑攻击诅咒卷轴70%
Array(2044005, 600, 1, 1), //双手剑攻击诅咒卷轴30%
Array(2044006, 600, 1, 1), //双手剑攻击卷轴65%
Array(2044007, 600, 1, 1), //双手剑攻击卷轴15%
Array(2044010, 600, 1, 0), //双手剑命中率卷轴100%
Array(2044011, 600, 1, 0), //双手剑命中率卷轴70%
Array(2044012, 600, 1, 0), //双手剑命中率卷轴60%
Array(2044013, 600, 1, 0), //双手剑命中率卷轴30%
Array(2044014, 600, 1, 0), //双手剑命中率卷轴10%
Array(3010029, 450, 1, 1), //蓝环凳
Array(3010030, 450, 1, 1), //黑环凳
Array(3010031, 450, 1, 1), //红环凳
Array(3010032, 450, 1, 1), //黄环凳
Array(3010033, 450, 1, 1), //绿环凳
Array(3010037, 450, 1, 1), //猪猪凳
Array(3010044, 450, 1, 1), //同一红伞下
Array(3012001, 450, 1, 1), //篝火
Array(3012002, 450, 1, 1), //浴桶
Array(3010073, 450, 1, 1), //PB克缤
Array(3012003, 450, 1, 1), //爱心椅子
Array(3010012, 450, 1, 1), //剑士 宝座
Array(3010025, 450, 1, 1), //枫叶纪念凳
Array(3010037, 450, 1, 1), //猪猪凳
Array(3010038, 450, 1, 1), //爱心椅子
Array(3010040, 450, 1, 1), //蝙蝠椅
Array(3010041, 450, 1, 1), //骷髅王座
Array(3010043, 450, 1, 1), //魔女的飞扫把
Array(3010044, 450, 1, 1), //同一红伞下
Array(3010045, 450, 1, 1), //寒冰椅子
Array(3010046, 450, 1, 1), //红龙椅
Array(3010047, 400, 1, 1), //蓝龙椅
Array(3010048, 400, 1, 1), //圣诞树椅子
Array(3010049, 400, 1, 1), //雪房子
Array(3010050, 400, 1, 1), //公主凳
Array(3010057, 400, 1, 1), //血色玫瑰
Array(3010058, 400, 1, 1), //世界末日
Array(3010068, 400, 1, 1), //露水椅子
Array(3010071, 425, 1, 1), //神兽椅
Array(3010077, 425, 1, 1), //猫头鹰椅子
Array(3010085, 425, 1, 1), //鬼娃娃椅子
Array(3010096, 425, 1, 1), //恐龙化石宝座
Array(3010095, 425, 1, 1), //石头人座椅
Array(3010094, 415, 1, 1), //漂漂猪椅子
Array(3010098, 425, 1, 1), //电视宅人
Array(3010106, 425, 1, 1), //雪狼战椅
Array(1102481,1,1,1),//暴君西亚戴斯披风
Array(1102485,1,1,1),//暴君阿尔泰披风
Array(1102484,1,1,1),//暴君利卡昂披风
Array(1102483,1,1,1),//暴君凯伦披风
Array(1102482,1,1,1),//暴君赫尔梅斯披风
Array(1132174,1,1,1),//暴君西亚戴斯腰带
Array(1132175,1,1,1),//暴君赫尔梅斯腰带
Array(1132176,1,1,1),//暴君凯伦腰带
Array(1132177,1,1,1),//暴君利卡昂腰带
Array(1132178,1,1,1),//暴君阿尔泰腰带
Array(1082544,1,1,1),//暴君赫尔梅斯手套
Array(1082545,1,1,1),//暴君凯伦手套
Array(1082546,10,1,1),//暴君利卡昂手套
Array(1082547,10,1,1),//暴君阿尔泰手套
Array(1082543,10,1,1),//暴君西亚戴斯手套
//Array(1690308,100,1,1),//暴君披风
Array(1072743,1,1,1),//暴君西亚戴斯靴
Array(1072744,1,1,1),//暴君赫尔梅斯靴
Array(1072746,1,1,1),//暴君利卡昂靴
Array(1072745,1,1,1),//暴君凯伦靴
Array(1072747,5,1,1),//暴君阿尔泰靴
Array(1072769,5,1,1),//争执靴
Array(1432137,200,1,1),
//------药水------

Array(3010112, 425, 1, 1)
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4110000)) {
            cm.sendYesNo("#b#v1072747##v1072746##v1072745##v1132175##v1132177##v1082543##v1102481##v1102482##v1082546##v1082547##v1432176##v1492188##v1462202##v1382220##v1452214##v1402204##v1412126##v1452196##v1472205##v1492170##v1432158##v1482159##v1462184##v1322161##v1432137##v1462157##v1372137##v1003540##v3010757##v3015051##v3010041##v3010040##v4001226##v4251202##v2340000##v1402037##v1432049##k ");
        } else {
            cm.sendOk("你背包里有#b#t4110000##k吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 700);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "百宝卷抽奖", notice);
            if (item != -1) {
                cm.gainItem(4110000, -1);
                //cm.gainExp( + 9000000);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t4110000##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：白雪人法老的蓝宝石。)");
            cm.gainItem(1122059, -1);
            cm.gainItem(4001322, 1);
            cm.safeDispose();
        }
    }
}